remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
/**
 * \file
 *
 * \brief Component description for PROV_DMA_CTRL
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_PROV_DMA_CTRL_COMPONENT_
#define _SAMB11_PROV_DMA_CTRL_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PROV_DMA_CTRL */
/* ========================================================================== */
/** \addtogroup SAMB11_PROV_DMA_CTRL 4 Channel DMA Controller 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define PROV_DMA_CTRL_PDC1234
#define REV_PROV_DMA_CTRL                0x100

/* -------- PROV_DMA_CTRL_CH0_CMD_REG0 : (PROV_DMA_CTRL Offset: 0x00) (R/W 32) Channel 0 First Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_START_ADDR:32;          /**< bit:  0..31  Start Address of Read Buffer             */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_CMD_REG0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_CMD_REG0_OFFSET   0x00                                          /**<  (PROV_DMA_CTRL_CH0_CMD_REG0) Channel 0 First Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH0_CMD_REG0_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_CMD_REG0) Channel 0 First Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH0_CMD_REG0_RD_START_ADDR_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_CMD_REG0) Start Address of Read Buffer Position */
#define PROV_DMA_CTRL_CH0_CMD_REG0_RD_START_ADDR_Msk (0xFFFFFFFFu << PROV_DMA_CTRL_CH0_CMD_REG0_RD_START_ADDR_Pos)  /**< (PROV_DMA_CTRL_CH0_CMD_REG0) Start Address of Read Buffer Mask */
#define PROV_DMA_CTRL_CH0_CMD_REG0_RD_START_ADDR(value) (PROV_DMA_CTRL_CH0_CMD_REG0_RD_START_ADDR_Msk & ((value) << PROV_DMA_CTRL_CH0_CMD_REG0_RD_START_ADDR_Pos))
#define PROV_DMA_CTRL_CH0_CMD_REG0_MASK     0xFFFFFFFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH0_CMD_REG0) Register MASK  (Use PROV_DMA_CTRL_CH0_CMD_REG0_Msk instead)  */
#define PROV_DMA_CTRL_CH0_CMD_REG0_Msk      0xFFFFFFFFu                                    /**< (PROV_DMA_CTRL_CH0_CMD_REG0) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_CMD_REG1 : (PROV_DMA_CTRL Offset: 0x04) (R/W 32) Channel 0 Second Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WR_START_ADDR:32;          /**< bit:  0..31  Start Address of Write Buffer            */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_CMD_REG1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_CMD_REG1_OFFSET   0x04                                          /**<  (PROV_DMA_CTRL_CH0_CMD_REG1) Channel 0 Second Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH0_CMD_REG1_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_CMD_REG1) Channel 0 Second Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH0_CMD_REG1_WR_START_ADDR_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_CMD_REG1) Start Address of Write Buffer Position */
#define PROV_DMA_CTRL_CH0_CMD_REG1_WR_START_ADDR_Msk (0xFFFFFFFFu << PROV_DMA_CTRL_CH0_CMD_REG1_WR_START_ADDR_Pos)  /**< (PROV_DMA_CTRL_CH0_CMD_REG1) Start Address of Write Buffer Mask */
#define PROV_DMA_CTRL_CH0_CMD_REG1_WR_START_ADDR(value) (PROV_DMA_CTRL_CH0_CMD_REG1_WR_START_ADDR_Msk & ((value) << PROV_DMA_CTRL_CH0_CMD_REG1_WR_START_ADDR_Pos))
#define PROV_DMA_CTRL_CH0_CMD_REG1_MASK     0xFFFFFFFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH0_CMD_REG1) Register MASK  (Use PROV_DMA_CTRL_CH0_CMD_REG1_Msk instead)  */
#define PROV_DMA_CTRL_CH0_CMD_REG1_Msk      0xFFFFFFFFu                                    /**< (PROV_DMA_CTRL_CH0_CMD_REG1) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_CMD_REG2 : (PROV_DMA_CTRL Offset: 0x08) (R/W 16) Channel 0 Third Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t BUFFER_SIZE:13;            /**< bit:  0..12  Size (in Bytes) of Buffer to Transfer    */
    uint16_t :3;                        /**< bit: 13..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_CMD_REG2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_CMD_REG2_OFFSET   0x08                                          /**<  (PROV_DMA_CTRL_CH0_CMD_REG2) Channel 0 Third Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH0_CMD_REG2_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_CMD_REG2) Channel 0 Third Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH0_CMD_REG2_BUFFER_SIZE_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_CMD_REG2) Size (in Bytes) of Buffer to Transfer Position */
#define PROV_DMA_CTRL_CH0_CMD_REG2_BUFFER_SIZE_Msk (0x1FFFu << PROV_DMA_CTRL_CH0_CMD_REG2_BUFFER_SIZE_Pos)  /**< (PROV_DMA_CTRL_CH0_CMD_REG2) Size (in Bytes) of Buffer to Transfer Mask */
#define PROV_DMA_CTRL_CH0_CMD_REG2_BUFFER_SIZE(value) (PROV_DMA_CTRL_CH0_CMD_REG2_BUFFER_SIZE_Msk & ((value) << PROV_DMA_CTRL_CH0_CMD_REG2_BUFFER_SIZE_Pos))
#define PROV_DMA_CTRL_CH0_CMD_REG2_MASK     0x1FFFu                                        /**< \deprecated (PROV_DMA_CTRL_CH0_CMD_REG2) Register MASK  (Use PROV_DMA_CTRL_CH0_CMD_REG2_Msk instead)  */
#define PROV_DMA_CTRL_CH0_CMD_REG2_Msk      0x1FFFu                                        /**< (PROV_DMA_CTRL_CH0_CMD_REG2) Register Mask  */

