remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
/* -------- PROV_DMA_CTRL_CH0_CMD_REG3 : (PROV_DMA_CTRL Offset: 0x0c) (R/W 32) Channel 0 Fourth Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CMD_SET_INT:1;             /**< bit:      0  Active High Interrupt Enable once buffer has been transfered */
    uint32_t CMD_LAST:1;                /**< bit:      1  If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR */
    uint32_t CMD_NEXT_ADDR:30;          /**< bit:  2..31  Address of next command if CMD_LAST is not set */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_CMD_REG3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_CMD_REG3_OFFSET   0x0C                                          /**<  (PROV_DMA_CTRL_CH0_CMD_REG3) Channel 0 Fourth Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH0_CMD_REG3_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_CMD_REG3) Channel 0 Fourth Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_SET_INT_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_CMD_REG3) Active High Interrupt Enable once buffer has been transfered Position */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_SET_INT_Msk (0x1u << PROV_DMA_CTRL_CH0_CMD_REG3_CMD_SET_INT_Pos)  /**< (PROV_DMA_CTRL_CH0_CMD_REG3) Active High Interrupt Enable once buffer has been transfered Mask */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_SET_INT PROV_DMA_CTRL_CH0_CMD_REG3_CMD_SET_INT_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_CMD_REG3_CMD_SET_INT_Msk instead */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_LAST_Pos 1                                              /**< (PROV_DMA_CTRL_CH0_CMD_REG3) If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR Position */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_LAST_Msk (0x1u << PROV_DMA_CTRL_CH0_CMD_REG3_CMD_LAST_Pos)  /**< (PROV_DMA_CTRL_CH0_CMD_REG3) If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR Mask */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_LAST PROV_DMA_CTRL_CH0_CMD_REG3_CMD_LAST_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_CMD_REG3_CMD_LAST_Msk instead */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_NEXT_ADDR_Pos 2                                              /**< (PROV_DMA_CTRL_CH0_CMD_REG3) Address of next command if CMD_LAST is not set Position */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_NEXT_ADDR_Msk (0x3FFFFFFFu << PROV_DMA_CTRL_CH0_CMD_REG3_CMD_NEXT_ADDR_Pos)  /**< (PROV_DMA_CTRL_CH0_CMD_REG3) Address of next command if CMD_LAST is not set Mask */
#define PROV_DMA_CTRL_CH0_CMD_REG3_CMD_NEXT_ADDR(value) (PROV_DMA_CTRL_CH0_CMD_REG3_CMD_NEXT_ADDR_Msk & ((value) << PROV_DMA_CTRL_CH0_CMD_REG3_CMD_NEXT_ADDR_Pos))
#define PROV_DMA_CTRL_CH0_CMD_REG3_MASK     0xFFFFFFFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH0_CMD_REG3) Register MASK  (Use PROV_DMA_CTRL_CH0_CMD_REG3_Msk instead)  */
#define PROV_DMA_CTRL_CH0_CMD_REG3_Msk      0xFFFFFFFFu                                    /**< (PROV_DMA_CTRL_CH0_CMD_REG3) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_STATIC_REG0 : (PROV_DMA_CTRL Offset: 0x10) (R/W 32) Channel 0 Static Configuration Read -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_BURST_MAX_SIZE:7;       /**< bit:   0..6  Maximum number of bytes of an AHB read burst */
    uint32_t :9;                        /**< bit:  7..15  Reserved */
    uint32_t RD_TOKENS:6;               /**< bit: 16..21  Number of AHB read commands to issue before channel is released */
    uint32_t :9;                        /**< bit: 22..30  Reserved */
    uint32_t RD_INCR:1;                 /**< bit:     31  If set the controller will increment the next burst address */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_STATIC_REG0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_STATIC_REG0_OFFSET 0x10                                          /**<  (PROV_DMA_CTRL_CH0_STATIC_REG0) Channel 0 Static Configuration Read  Offset */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RESETVALUE 0x80010000u                                   /**<  (PROV_DMA_CTRL_CH0_STATIC_REG0) Channel 0 Static Configuration Read  Reset Value */

#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_BURST_MAX_SIZE_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_STATIC_REG0) Maximum number of bytes of an AHB read burst Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_BURST_MAX_SIZE_Msk (0x7Fu << PROV_DMA_CTRL_CH0_STATIC_REG0_RD_BURST_MAX_SIZE_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG0) Maximum number of bytes of an AHB read burst Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_BURST_MAX_SIZE(value) (PROV_DMA_CTRL_CH0_STATIC_REG0_RD_BURST_MAX_SIZE_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG0_RD_BURST_MAX_SIZE_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_TOKENS_Pos 16                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG0) Number of AHB read commands to issue before channel is released Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_TOKENS_Msk (0x3Fu << PROV_DMA_CTRL_CH0_STATIC_REG0_RD_TOKENS_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG0) Number of AHB read commands to issue before channel is released Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_TOKENS(value) (PROV_DMA_CTRL_CH0_STATIC_REG0_RD_TOKENS_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG0_RD_TOKENS_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_INCR_Pos 31                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG0) If set the controller will increment the next burst address Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_INCR_Msk (0x1u << PROV_DMA_CTRL_CH0_STATIC_REG0_RD_INCR_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG0) If set the controller will increment the next burst address Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_RD_INCR PROV_DMA_CTRL_CH0_STATIC_REG0_RD_INCR_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_STATIC_REG0_RD_INCR_Msk instead */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_MASK  0x803F007Fu                                    /**< \deprecated (PROV_DMA_CTRL_CH0_STATIC_REG0) Register MASK  (Use PROV_DMA_CTRL_CH0_STATIC_REG0_Msk instead)  */
#define PROV_DMA_CTRL_CH0_STATIC_REG0_Msk   0x803F007Fu                                    /**< (PROV_DMA_CTRL_CH0_STATIC_REG0) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_STATIC_REG1 : (PROV_DMA_CTRL Offset: 0x14) (R/W 32) Channel 0 Static Configuration Write -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WR_BURST_MAX_SIZE:7;       /**< bit:   0..6  Maximum number of bytes of an AHB write burst */
    uint32_t :9;                        /**< bit:  7..15  Reserved */
    uint32_t WR_TOKENS:6;               /**< bit: 16..21  Number of AHB write commands to issue before channel is released */
    uint32_t :9;                        /**< bit: 22..30  Reserved */
    uint32_t WR_INCR:1;                 /**< bit:     31  If set the controller will increment the next burst address */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_STATIC_REG1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_STATIC_REG1_OFFSET 0x14                                          /**<  (PROV_DMA_CTRL_CH0_STATIC_REG1) Channel 0 Static Configuration Write  Offset */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_RESETVALUE 0x80010000u                                   /**<  (PROV_DMA_CTRL_CH0_STATIC_REG1) Channel 0 Static Configuration Write  Reset Value */

#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_BURST_MAX_SIZE_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_STATIC_REG1) Maximum number of bytes of an AHB write burst Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_BURST_MAX_SIZE_Msk (0x7Fu << PROV_DMA_CTRL_CH0_STATIC_REG1_WR_BURST_MAX_SIZE_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG1) Maximum number of bytes of an AHB write burst Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_BURST_MAX_SIZE(value) (PROV_DMA_CTRL_CH0_STATIC_REG1_WR_BURST_MAX_SIZE_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG1_WR_BURST_MAX_SIZE_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_TOKENS_Pos 16                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG1) Number of AHB write commands to issue before channel is released Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_TOKENS_Msk (0x3Fu << PROV_DMA_CTRL_CH0_STATIC_REG1_WR_TOKENS_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG1) Number of AHB write commands to issue before channel is released Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_TOKENS(value) (PROV_DMA_CTRL_CH0_STATIC_REG1_WR_TOKENS_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG1_WR_TOKENS_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_INCR_Pos 31                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG1) If set the controller will increment the next burst address Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_INCR_Msk (0x1u << PROV_DMA_CTRL_CH0_STATIC_REG1_WR_INCR_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG1) If set the controller will increment the next burst address Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_WR_INCR PROV_DMA_CTRL_CH0_STATIC_REG1_WR_INCR_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_STATIC_REG1_WR_INCR_Msk instead */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_MASK  0x803F007Fu                                    /**< \deprecated (PROV_DMA_CTRL_CH0_STATIC_REG1) Register MASK  (Use PROV_DMA_CTRL_CH0_STATIC_REG1_Msk instead)  */
#define PROV_DMA_CTRL_CH0_STATIC_REG1_Msk   0x803F007Fu                                    /**< (PROV_DMA_CTRL_CH0_STATIC_REG1) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_STATIC_REG2 : (PROV_DMA_CTRL Offset: 0x18) (R/W 32) Channel 0 Block Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :16;                       /**< bit:  0..15  Reserved */
    uint32_t JOINT:1;                   /**< bit:     16  If set channel will work in joint mode   */
    uint32_t :11;                       /**< bit: 17..27  Reserved */
    uint32_t END_SWAP:2;                /**< bit: 28..29  Endianness Byte Swapping                 */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_STATIC_REG2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_STATIC_REG2_OFFSET 0x18                                          /**<  (PROV_DMA_CTRL_CH0_STATIC_REG2) Channel 0 Block Mode  Offset */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_RESETVALUE 0x10000u                                      /**<  (PROV_DMA_CTRL_CH0_STATIC_REG2) Channel 0 Block Mode  Reset Value */

#define PROV_DMA_CTRL_CH0_STATIC_REG2_JOINT_Pos 16                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) If set channel will work in joint mode Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_JOINT_Msk (0x1u << PROV_DMA_CTRL_CH0_STATIC_REG2_JOINT_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) If set channel will work in joint mode Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_JOINT PROV_DMA_CTRL_CH0_STATIC_REG2_JOINT_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_STATIC_REG2_JOINT_Msk instead */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Pos 28                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Endianness Byte Swapping Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Msk (0x3u << PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Endianness Byte Swapping Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP(value) (PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Pos))
#define   PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_0_Val 0x0u                                           /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) No Swapping  */
#define   PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_1_Val 0x1u                                           /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Swap bytes within 16 bits  */
#define   PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_2_Val 0x2u                                           /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Swap bytes within 32 bits  */
#define   PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_3_Val 0x3u                                           /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Swap bytes within 64 bits  */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_0 (PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_0_Val << PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) No Swapping Position  */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_1 (PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_1_Val << PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Swap bytes within 16 bits Position  */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_2 (PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_2_Val << PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Swap bytes within 32 bits Position  */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_3 (PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_3_Val << PROV_DMA_CTRL_CH0_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Swap bytes within 64 bits Position  */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_MASK  0x30010000u                                    /**< \deprecated (PROV_DMA_CTRL_CH0_STATIC_REG2) Register MASK  (Use PROV_DMA_CTRL_CH0_STATIC_REG2_Msk instead)  */
#define PROV_DMA_CTRL_CH0_STATIC_REG2_Msk   0x30010000u                                    /**< (PROV_DMA_CTRL_CH0_STATIC_REG2) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_STATIC_REG4 : (PROV_DMA_CTRL Offset: 0x20) (R/W 32) Channel 0 Static Configuration Peripheral -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_PERIPH_NUM:5;           /**< bit:   0..4  Number of peripheral to read from (0 if memory or no peripheral flow control) */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t RD_PERIPH_DELAY:3;         /**< bit:  8..10  Number of cycles to wait for read request signal to update after issuing the read clear signal */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t WR_PERIPH_NUM:5;           /**< bit: 16..20  Number of peripheral to write from (0 if memory or no peripheral flow control) */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t WR_PERIPH_DELAY:3;         /**< bit: 24..26  Number of cycles to wait for write request signal to update after issuing the write clear signal */
    uint32_t :5;                        /**< bit: 27..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_STATIC_REG4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

