remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CH0_STATIC_REG4_OFFSET 0x20                                          /**<  (PROV_DMA_CTRL_CH0_STATIC_REG4) Channel 0 Static Configuration Peripheral  Offset */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_STATIC_REG4) Channel 0 Static Configuration Peripheral  Reset Value */

#define PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_NUM_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of peripheral to read from (0 if memory or no peripheral flow control) Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_NUM_Msk (0x1Fu << PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_NUM_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of peripheral to read from (0 if memory or no peripheral flow control) Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_NUM(value) (PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_NUM_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_NUM_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_DELAY_Pos 8                                              /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of cycles to wait for read request signal to update after issuing the read clear signal Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_DELAY_Msk (0x7u << PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_DELAY_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of cycles to wait for read request signal to update after issuing the read clear signal Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_DELAY(value) (PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_DELAY_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG4_RD_PERIPH_DELAY_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_NUM_Pos 16                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of peripheral to write from (0 if memory or no peripheral flow control) Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_NUM_Msk (0x1Fu << PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_NUM_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of peripheral to write from (0 if memory or no peripheral flow control) Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_NUM(value) (PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_NUM_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_NUM_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_DELAY_Pos 24                                             /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of cycles to wait for write request signal to update after issuing the write clear signal Position */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_DELAY_Msk (0x7u << PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_DELAY_Pos)  /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Number of cycles to wait for write request signal to update after issuing the write clear signal Mask */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_DELAY(value) (PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_DELAY_Msk & ((value) << PROV_DMA_CTRL_CH0_STATIC_REG4_WR_PERIPH_DELAY_Pos))
#define PROV_DMA_CTRL_CH0_STATIC_REG4_MASK  0x71F071Fu                                     /**< \deprecated (PROV_DMA_CTRL_CH0_STATIC_REG4) Register MASK  (Use PROV_DMA_CTRL_CH0_STATIC_REG4_Msk instead)  */
#define PROV_DMA_CTRL_CH0_STATIC_REG4_Msk   0x71F071Fu                                     /**< (PROV_DMA_CTRL_CH0_STATIC_REG4) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_RESRICT_REG : (PROV_DMA_CTRL Offset: 0x2c) (R/ 16) Channel 0 Restrictions Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t RD_ALLOW_FULL_FIFO:1;      /**< bit:      0  Read start address does not restrict burst size */
    uint16_t WR_ALLOW_FULL_FIFO:1;      /**< bit:      1  Write start address does not restrict burst size */
    uint16_t ALLOW_FULL_FIFO:1;         /**< bit:      2  Burst sizes can equal data buffer size, otherwise max burst is half data buffer size */
    uint16_t ALLOW_FULL_BURST:1;        /**< bit:      3  Maximum burst of 16 strobes can be used (joint mode only) */
    uint16_t ALLOW_JOINT_BURST:1;       /**< bit:      4  Joint bursts are currently active        */
    uint16_t :3;                        /**< bit:   5..7  Reserved */
    uint16_t SIMPLE_MEM:1;              /**< bit:      8  Configuration is aligned and peripherals are not used */
    uint16_t :7;                        /**< bit:  9..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_RESRICT_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_RESRICT_REG_OFFSET 0x2C                                          /**<  (PROV_DMA_CTRL_CH0_RESRICT_REG) Channel 0 Restrictions Status Register  Offset */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_RESRICT_REG) Channel 0 Restrictions Status Register  Reset Value */

#define PROV_DMA_CTRL_CH0_RESRICT_REG_RD_ALLOW_FULL_FIFO_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Read start address does not restrict burst size Position */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_RD_ALLOW_FULL_FIFO_Msk (0x1u << PROV_DMA_CTRL_CH0_RESRICT_REG_RD_ALLOW_FULL_FIFO_Pos)  /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Read start address does not restrict burst size Mask */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_RD_ALLOW_FULL_FIFO PROV_DMA_CTRL_CH0_RESRICT_REG_RD_ALLOW_FULL_FIFO_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_RESRICT_REG_RD_ALLOW_FULL_FIFO_Msk instead */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_WR_ALLOW_FULL_FIFO_Pos 1                                              /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Write start address does not restrict burst size Position */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_WR_ALLOW_FULL_FIFO_Msk (0x1u << PROV_DMA_CTRL_CH0_RESRICT_REG_WR_ALLOW_FULL_FIFO_Pos)  /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Write start address does not restrict burst size Mask */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_WR_ALLOW_FULL_FIFO PROV_DMA_CTRL_CH0_RESRICT_REG_WR_ALLOW_FULL_FIFO_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_RESRICT_REG_WR_ALLOW_FULL_FIFO_Msk instead */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_FIFO_Pos 2                                              /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Burst sizes can equal data buffer size, otherwise max burst is half data buffer size Position */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_FIFO_Msk (0x1u << PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_FIFO_Pos)  /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Burst sizes can equal data buffer size, otherwise max burst is half data buffer size Mask */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_FIFO PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_FIFO_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_FIFO_Msk instead */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_BURST_Pos 3                                              /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Maximum burst of 16 strobes can be used (joint mode only) Position */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_BURST_Msk (0x1u << PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_BURST_Pos)  /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Maximum burst of 16 strobes can be used (joint mode only) Mask */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_BURST PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_BURST_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_FULL_BURST_Msk instead */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_JOINT_BURST_Pos 4                                              /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Joint bursts are currently active Position */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_JOINT_BURST_Msk (0x1u << PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_JOINT_BURST_Pos)  /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Joint bursts are currently active Mask */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_JOINT_BURST PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_JOINT_BURST_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_RESRICT_REG_ALLOW_JOINT_BURST_Msk instead */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_SIMPLE_MEM_Pos 8                                              /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Configuration is aligned and peripherals are not used Position */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_SIMPLE_MEM_Msk (0x1u << PROV_DMA_CTRL_CH0_RESRICT_REG_SIMPLE_MEM_Pos)  /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Configuration is aligned and peripherals are not used Mask */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_SIMPLE_MEM PROV_DMA_CTRL_CH0_RESRICT_REG_SIMPLE_MEM_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_RESRICT_REG_SIMPLE_MEM_Msk instead */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_MASK  0x11Fu                                         /**< \deprecated (PROV_DMA_CTRL_CH0_RESRICT_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_RESRICT_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_RESRICT_REG_Msk   0x11Fu                                         /**< (PROV_DMA_CTRL_CH0_RESRICT_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG : (PROV_DMA_CTRL Offset: 0x38) (R/ 32) Channel 0 FIFO Fullness Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_GAP:13;                 /**< bit:  0..12  Remaining space (in bytes) in FIFO for read data */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t WR_FULLNESS:13;            /**< bit: 16..28  Occupied space (in bytes) in FIFO by write data */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_OFFSET 0x38                                          /**<  (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Channel 0 FIFO Fullness Status Register  Offset */
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Channel 0 FIFO Fullness Status Register  Reset Value */

#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_RD_GAP_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Remaining space (in bytes) in FIFO for read data Position */
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_RD_GAP_Msk (0x1FFFu << PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_RD_GAP_Pos)  /**< (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Remaining space (in bytes) in FIFO for read data Mask */
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_RD_GAP(value) (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_RD_GAP_Msk & ((value) << PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_RD_GAP_Pos))
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_WR_FULLNESS_Pos 16                                             /**< (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Occupied space (in bytes) in FIFO by write data Position */
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_WR_FULLNESS_Msk (0x1FFFu << PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_WR_FULLNESS_Pos)  /**< (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Occupied space (in bytes) in FIFO by write data Mask */
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_WR_FULLNESS(value) (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_WR_FULLNESS_Msk & ((value) << PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_WR_FULLNESS_Pos))
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_MASK 0x1FFF1FFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_Msk 0x1FFF1FFFu                                    /**< (PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_CH_ENABLE_REG : (PROV_DMA_CTRL Offset: 0x40) (R/W 8) Channel 0 Channel Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH0_CH_ENABLE_REG:1;       /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_CH_ENABLE_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_CH_ENABLE_REG_OFFSET 0x40                                          /**<  (PROV_DMA_CTRL_CH0_CH_ENABLE_REG) Channel 0 Channel Enable Register  Offset */
#define PROV_DMA_CTRL_CH0_CH_ENABLE_REG_RESETVALUE 0x01u                                         /**<  (PROV_DMA_CTRL_CH0_CH_ENABLE_REG) Channel 0 Channel Enable Register  Reset Value */

#define PROV_DMA_CTRL_CH0_CH_ENABLE_REG_CH0_CH_ENABLE_REG_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_CH_ENABLE_REG)  Position */
#define PROV_DMA_CTRL_CH0_CH_ENABLE_REG_CH0_CH_ENABLE_REG_Msk (0x1u << PROV_DMA_CTRL_CH0_CH_ENABLE_REG_CH0_CH_ENABLE_REG_Pos)  /**< (PROV_DMA_CTRL_CH0_CH_ENABLE_REG)  Mask */
#define PROV_DMA_CTRL_CH0_CH_ENABLE_REG_CH0_CH_ENABLE_REG PROV_DMA_CTRL_CH0_CH_ENABLE_REG_CH0_CH_ENABLE_REG_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_CH_ENABLE_REG_CH0_CH_ENABLE_REG_Msk instead */
#define PROV_DMA_CTRL_CH0_CH_ENABLE_REG_MASK 0x01u                                          /**< \deprecated (PROV_DMA_CTRL_CH0_CH_ENABLE_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_CH_ENABLE_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_CH_ENABLE_REG_Msk 0x01u                                          /**< (PROV_DMA_CTRL_CH0_CH_ENABLE_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_CH_START_REG : (PROV_DMA_CTRL Offset: 0x44) (/W 8) Channel 0 Channel Start Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH0_CH_START_REG:1;        /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_CH_START_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

