remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CH0_CH_START_REG_OFFSET 0x44                                          /**<  (PROV_DMA_CTRL_CH0_CH_START_REG) Channel 0 Channel Start Register  Offset */
#define PROV_DMA_CTRL_CH0_CH_START_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_CH_START_REG) Channel 0 Channel Start Register  Reset Value */

#define PROV_DMA_CTRL_CH0_CH_START_REG_CH0_CH_START_REG_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_CH_START_REG)  Position */
#define PROV_DMA_CTRL_CH0_CH_START_REG_CH0_CH_START_REG_Msk (0x1u << PROV_DMA_CTRL_CH0_CH_START_REG_CH0_CH_START_REG_Pos)  /**< (PROV_DMA_CTRL_CH0_CH_START_REG)  Mask */
#define PROV_DMA_CTRL_CH0_CH_START_REG_CH0_CH_START_REG PROV_DMA_CTRL_CH0_CH_START_REG_CH0_CH_START_REG_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_CH_START_REG_CH0_CH_START_REG_Msk instead */
#define PROV_DMA_CTRL_CH0_CH_START_REG_MASK 0x01u                                          /**< \deprecated (PROV_DMA_CTRL_CH0_CH_START_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_CH_START_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_CH_START_REG_Msk  0x01u                                          /**< (PROV_DMA_CTRL_CH0_CH_START_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_CH_ACTIVE_REG : (PROV_DMA_CTRL Offset: 0x48) (R/ 8) Channel 0 Channel Active Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH_RD_ACTIVE:1;            /**< bit:      0  Set if channel is enabled and all read data has been received */
    uint8_t  CH_WR_ACTIVE:1;            /**< bit:      1  Set if channel is enabled and all write data has been transfered */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_OFFSET 0x48                                          /**<  (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Channel 0 Channel Active Status Register  Offset */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Channel 0 Channel Active Status Register  Reset Value */

#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_RD_ACTIVE_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Set if channel is enabled and all read data has been received Position */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_RD_ACTIVE_Msk (0x1u << PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_RD_ACTIVE_Pos)  /**< (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Set if channel is enabled and all read data has been received Mask */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_RD_ACTIVE PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_RD_ACTIVE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_RD_ACTIVE_Msk instead */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_WR_ACTIVE_Pos 1                                              /**< (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Set if channel is enabled and all write data has been transfered Position */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_WR_ACTIVE_Msk (0x1u << PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_WR_ACTIVE_Pos)  /**< (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Set if channel is enabled and all write data has been transfered Mask */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_WR_ACTIVE PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_WR_ACTIVE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_CH_WR_ACTIVE_Msk instead */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_MASK 0x03u                                          /**< \deprecated (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_Msk 0x03u                                          /**< (PROV_DMA_CTRL_CH0_CH_ACTIVE_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_COUNT_REG : (PROV_DMA_CTRL Offset: 0x50) (R/ 32) Channel 0 Buffer Counter Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t BUFF_COUNT:12;             /**< bit:  0..11  Number of buffers transferred by channel since started */
    uint32_t :4;                        /**< bit: 12..15  Reserved */
    uint32_t INT_COUNT:4;               /**< bit: 16..19  Number of unserviced end interrupts      */
    uint32_t :12;                       /**< bit: 20..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_COUNT_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_COUNT_REG_OFFSET  0x50                                          /**<  (PROV_DMA_CTRL_CH0_COUNT_REG) Channel 0 Buffer Counter Status Register  Offset */
#define PROV_DMA_CTRL_CH0_COUNT_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_COUNT_REG) Channel 0 Buffer Counter Status Register  Reset Value */

#define PROV_DMA_CTRL_CH0_COUNT_REG_BUFF_COUNT_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_COUNT_REG) Number of buffers transferred by channel since started Position */
#define PROV_DMA_CTRL_CH0_COUNT_REG_BUFF_COUNT_Msk (0xFFFu << PROV_DMA_CTRL_CH0_COUNT_REG_BUFF_COUNT_Pos)  /**< (PROV_DMA_CTRL_CH0_COUNT_REG) Number of buffers transferred by channel since started Mask */
#define PROV_DMA_CTRL_CH0_COUNT_REG_BUFF_COUNT(value) (PROV_DMA_CTRL_CH0_COUNT_REG_BUFF_COUNT_Msk & ((value) << PROV_DMA_CTRL_CH0_COUNT_REG_BUFF_COUNT_Pos))
#define PROV_DMA_CTRL_CH0_COUNT_REG_INT_COUNT_Pos 16                                             /**< (PROV_DMA_CTRL_CH0_COUNT_REG) Number of unserviced end interrupts Position */
#define PROV_DMA_CTRL_CH0_COUNT_REG_INT_COUNT_Msk (0xFu << PROV_DMA_CTRL_CH0_COUNT_REG_INT_COUNT_Pos)  /**< (PROV_DMA_CTRL_CH0_COUNT_REG) Number of unserviced end interrupts Mask */
#define PROV_DMA_CTRL_CH0_COUNT_REG_INT_COUNT(value) (PROV_DMA_CTRL_CH0_COUNT_REG_INT_COUNT_Msk & ((value) << PROV_DMA_CTRL_CH0_COUNT_REG_INT_COUNT_Pos))
#define PROV_DMA_CTRL_CH0_COUNT_REG_MASK    0xF0FFFu                                       /**< \deprecated (PROV_DMA_CTRL_CH0_COUNT_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_COUNT_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_COUNT_REG_Msk     0xF0FFFu                                       /**< (PROV_DMA_CTRL_CH0_COUNT_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG : (PROV_DMA_CTRL Offset: 0xa0) (R/W 8) Channel 0 Interrupt Raw Status (Write 1 to any field to issue interrupt) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH_END:1;                  /**< bit:      0  Indicates an unserviced channel end interrupt */
    uint8_t  RD_SLVERR:1;               /**< bit:      1  AHB read slave error                     */
    uint8_t  WR_SLVERR:1;               /**< bit:      2  AHB write slave error                    */
    uint8_t  FIFO_OVERFLOW:1;           /**< bit:      3  FIFO has been overflown                  */
    uint8_t  FIFO_UNDERFLOW:1;          /**< bit:      4  FIFO has been underflown                 */
    uint8_t  TIMEOUT_RD:1;              /**< bit:      5  Read timeout on AHB bus (timeout value fixed at 1024 cycles) */
    uint8_t  TIMEOUT_WR:1;              /**< bit:      6  Write timeout on AHB bus (timeout value fixed at 1024 cycles) */
    uint8_t  WDT:1;                     /**< bit:      7  Channel active but did not start a burst for 2048 cycles */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_OFFSET 0xA0                                          /**<  (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Channel 0 Interrupt Raw Status (Write 1 to any field to issue interrupt)  Offset */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Channel 0 Interrupt Raw Status (Write 1 to any field to issue interrupt)  Reset Value */

#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_CH_END_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Indicates an unserviced channel end interrupt Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_CH_END_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_CH_END_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Indicates an unserviced channel end interrupt Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_CH_END PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_CH_END_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_CH_END_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_RD_SLVERR_Pos 1                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) AHB read slave error Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_RD_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_RD_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) AHB read slave error Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_RD_SLVERR PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_RD_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_RD_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WR_SLVERR_Pos 2                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) AHB write slave error Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WR_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WR_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) AHB write slave error Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WR_SLVERR PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WR_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WR_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_OVERFLOW_Pos 3                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) FIFO has been overflown Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_OVERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_OVERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) FIFO has been overflown Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_OVERFLOW PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_OVERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_OVERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_UNDERFLOW_Pos 4                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) FIFO has been underflown Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_UNDERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_UNDERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) FIFO has been underflown Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_UNDERFLOW PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_UNDERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_FIFO_UNDERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_RD_Pos 5                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Read timeout on AHB bus (timeout value fixed at 1024 cycles) Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_RD_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_RD_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Read timeout on AHB bus (timeout value fixed at 1024 cycles) Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_RD PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_RD_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_RD_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_WR_Pos 6                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Write timeout on AHB bus (timeout value fixed at 1024 cycles) Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_WR_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_WR_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Write timeout on AHB bus (timeout value fixed at 1024 cycles) Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_WR PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_WR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_TIMEOUT_WR_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WDT_Pos 7                                              /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Channel active but did not start a burst for 2048 cycles Position */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WDT_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WDT_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Channel active but did not start a burst for 2048 cycles Mask */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WDT PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WDT_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_WDT_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_MASK 0xFFu                                          /**< \deprecated (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_Msk 0xFFu                                          /**< (PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_INT_CLEAR_REG : (PROV_DMA_CTRL Offset: 0xa4) (R/W 8) Channel 0 Interrupt Clear (Write 1 to clear) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH_END:1;                  /**< bit:      0  Clear channel end interrupt. Decrements INT_COUNT register */
    uint8_t  RD_SLVERR:1;               /**< bit:      1  Clear AHB read slave error               */
    uint8_t  WR_SLVERR:1;               /**< bit:      2  Clear AHB write slave error              */
    uint8_t  FIFO_OVERFLOW:1;           /**< bit:      3  Clears FIFO overflow                     */
    uint8_t  FIFO_UNDERFLOW:1;          /**< bit:      4  Clears FIFO underflow                    */
    uint8_t  TIMEOUT_RD:1;              /**< bit:      5  Clears Read Timeout                      */
    uint8_t  TIMEOUT_WR:1;              /**< bit:      6  Clears Write Timeout                     */
    uint8_t  WDT:1;                     /**< bit:      7  Clears WDT                               */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_INT_CLEAR_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_OFFSET 0xA4                                          /**<  (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Channel 0 Interrupt Clear (Write 1 to clear)  Offset */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Channel 0 Interrupt Clear (Write 1 to clear)  Reset Value */

#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_CH_END_Pos 0                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clear channel end interrupt. Decrements INT_COUNT register Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_CH_END_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_CH_END_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clear channel end interrupt. Decrements INT_COUNT register Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_CH_END PROV_DMA_CTRL_CH0_INT_CLEAR_REG_CH_END_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_CH_END_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_RD_SLVERR_Pos 1                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clear AHB read slave error Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_RD_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_RD_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clear AHB read slave error Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_RD_SLVERR PROV_DMA_CTRL_CH0_INT_CLEAR_REG_RD_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_RD_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WR_SLVERR_Pos 2                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clear AHB write slave error Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WR_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WR_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clear AHB write slave error Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WR_SLVERR PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WR_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WR_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_OVERFLOW_Pos 3                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears FIFO overflow Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_OVERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_OVERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears FIFO overflow Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_OVERFLOW PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_OVERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_OVERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_UNDERFLOW_Pos 4                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears FIFO underflow Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_UNDERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_UNDERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears FIFO underflow Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_UNDERFLOW PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_UNDERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_FIFO_UNDERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_RD_Pos 5                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears Read Timeout Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_RD_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_RD_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears Read Timeout Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_RD PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_RD_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_RD_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_WR_Pos 6                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears Write Timeout Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_WR_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_WR_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears Write Timeout Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_WR PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_WR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_TIMEOUT_WR_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WDT_Pos 7                                              /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears WDT Position */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WDT_Msk (0x1u << PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WDT_Pos)  /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Clears WDT Mask */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WDT PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WDT_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_WDT_Msk instead */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_MASK 0xFFu                                          /**< \deprecated (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Register MASK  (Use PROV_DMA_CTRL_CH0_INT_CLEAR_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH0_INT_CLEAR_REG_Msk 0xFFu                                          /**< (PROV_DMA_CTRL_CH0_INT_CLEAR_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH0_INT_ENABLE_REG : (PROV_DMA_CTRL Offset: 0xa8) (R/W 8) Channel 0 Interrupt Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH_END:1;                  /**< bit:      0  Enables end of channel interrupt         */
    uint8_t  RD_SLVERR:1;               /**< bit:      1  Enables AHB read slave error interrupt   */
    uint8_t  WR_SLVERR:1;               /**< bit:      2  Enables AHB write slave error interrupt  */
    uint8_t  FIFO_OVERFLOW:1;           /**< bit:      3  Enables FIFO overflow interrupt          */
    uint8_t  FIFO_UNDERFLOW:1;          /**< bit:      4  Enables FIFO underflow interrupt         */
    uint8_t  TIMEOUT_RD:1;              /**< bit:      5  Enables AHB Read timeout interrupt       */
    uint8_t  TIMEOUT_WR:1;              /**< bit:      6  Enables AHB Write timeout interrupt      */
    uint8_t  WDT:1;                     /**< bit:      7  Enables WDT interrupt                    */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH0_INT_ENABLE_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

