remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_CH_END_Pos 0                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clear channel end interrupt. Decrements INT_COUNT register Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_CH_END_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_CH_END_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clear channel end interrupt. Decrements INT_COUNT register Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_CH_END PROV_DMA_CTRL_CH1_INT_CLEAR_REG_CH_END_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_CH_END_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_RD_SLVERR_Pos 1                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clear AHB read slave error Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_RD_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_RD_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clear AHB read slave error Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_RD_SLVERR PROV_DMA_CTRL_CH1_INT_CLEAR_REG_RD_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_RD_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WR_SLVERR_Pos 2                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clear AHB write slave error Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WR_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WR_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clear AHB write slave error Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WR_SLVERR PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WR_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WR_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_OVERFLOW_Pos 3                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears FIFO overflow Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_OVERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_OVERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears FIFO overflow Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_OVERFLOW PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_OVERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_OVERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_UNDERFLOW_Pos 4                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears FIFO underflow Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_UNDERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_UNDERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears FIFO underflow Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_UNDERFLOW PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_UNDERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_FIFO_UNDERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_RD_Pos 5                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears Read Timeout Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_RD_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_RD_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears Read Timeout Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_RD PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_RD_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_RD_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_WR_Pos 6                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears Write Timeout Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_WR_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_WR_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears Write Timeout Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_WR PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_WR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_TIMEOUT_WR_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WDT_Pos 7                                              /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears WDT Position */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WDT_Msk (0x1u << PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WDT_Pos)  /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Clears WDT Mask */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WDT PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WDT_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_WDT_Msk instead */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_MASK 0xFFu                                          /**< \deprecated (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Register MASK  (Use PROV_DMA_CTRL_CH1_INT_CLEAR_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH1_INT_CLEAR_REG_Msk 0xFFu                                          /**< (PROV_DMA_CTRL_CH1_INT_CLEAR_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH1_INT_ENABLE_REG : (PROV_DMA_CTRL Offset: 0x1a8) (R/W 8) Channel 1 Interrupt Enable -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH_END:1;                  /**< bit:      0  Enables end of channel interrupt         */
    uint8_t  RD_SLVERR:1;               /**< bit:      1  Enables AHB read slave error interrupt   */
    uint8_t  WR_SLVERR:1;               /**< bit:      2  Enables AHB write slave error interrupt  */
    uint8_t  FIFO_OVERFLOW:1;           /**< bit:      3  Enables FIFO overflow interrupt          */
    uint8_t  FIFO_UNDERFLOW:1;          /**< bit:      4  Enables FIFO underflow interrupt         */
    uint8_t  TIMEOUT_RD:1;              /**< bit:      5  Enables AHB Read timeout interrupt       */
    uint8_t  TIMEOUT_WR:1;              /**< bit:      6  Enables AHB Write timeout interrupt      */
    uint8_t  WDT:1;                     /**< bit:      7  Enables WDT interrupt                    */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH1_INT_ENABLE_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH1_INT_ENABLE_REG_OFFSET 0x1A8                                         /**<  (PROV_DMA_CTRL_CH1_INT_ENABLE_REG) Channel 1 Interrupt Enable  Offset */
#define PROV_DMA_CTRL_CH1_INT_ENABLE_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH1_INT_ENABLE_REG) Channel 1 Interrupt Enable  Reset Value */

