remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
/* -------- PROV_DMA_CTRL_CH2_STATIC_REG0 : (PROV_DMA_CTRL Offset: 0x210) (R/W 32) Channel 2 Static Configuration Read -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_BURST_MAX_SIZE:7;       /**< bit:   0..6  Maximum number of bytes of an AHB read burst */
    uint32_t :9;                        /**< bit:  7..15  Reserved */
    uint32_t RD_TOKENS:6;               /**< bit: 16..21  Number of AHB read commands to issue before channel is released */
    uint32_t :9;                        /**< bit: 22..30  Reserved */
    uint32_t RD_INCR:1;                 /**< bit:     31  If set the controller will increment the next burst address */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_STATIC_REG0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_STATIC_REG0_OFFSET 0x210                                         /**<  (PROV_DMA_CTRL_CH2_STATIC_REG0) Channel 2 Static Configuration Read  Offset */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RESETVALUE 0x80010000u                                   /**<  (PROV_DMA_CTRL_CH2_STATIC_REG0) Channel 2 Static Configuration Read  Reset Value */

#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_BURST_MAX_SIZE_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_STATIC_REG0) Maximum number of bytes of an AHB read burst Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_BURST_MAX_SIZE_Msk (0x7Fu << PROV_DMA_CTRL_CH2_STATIC_REG0_RD_BURST_MAX_SIZE_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG0) Maximum number of bytes of an AHB read burst Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_BURST_MAX_SIZE(value) (PROV_DMA_CTRL_CH2_STATIC_REG0_RD_BURST_MAX_SIZE_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG0_RD_BURST_MAX_SIZE_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_TOKENS_Pos 16                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG0) Number of AHB read commands to issue before channel is released Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_TOKENS_Msk (0x3Fu << PROV_DMA_CTRL_CH2_STATIC_REG0_RD_TOKENS_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG0) Number of AHB read commands to issue before channel is released Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_TOKENS(value) (PROV_DMA_CTRL_CH2_STATIC_REG0_RD_TOKENS_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG0_RD_TOKENS_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_INCR_Pos 31                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG0) If set the controller will increment the next burst address Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_INCR_Msk (0x1u << PROV_DMA_CTRL_CH2_STATIC_REG0_RD_INCR_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG0) If set the controller will increment the next burst address Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_RD_INCR PROV_DMA_CTRL_CH2_STATIC_REG0_RD_INCR_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_STATIC_REG0_RD_INCR_Msk instead */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_MASK  0x803F007Fu                                    /**< \deprecated (PROV_DMA_CTRL_CH2_STATIC_REG0) Register MASK  (Use PROV_DMA_CTRL_CH2_STATIC_REG0_Msk instead)  */
#define PROV_DMA_CTRL_CH2_STATIC_REG0_Msk   0x803F007Fu                                    /**< (PROV_DMA_CTRL_CH2_STATIC_REG0) Register Mask  */

/* -------- PROV_DMA_CTRL_CH2_STATIC_REG1 : (PROV_DMA_CTRL Offset: 0x214) (R/W 32) Channel 2 Static Configuration Write -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WR_BURST_MAX_SIZE:7;       /**< bit:   0..6  Maximum number of bytes of an AHB write burst */
    uint32_t :9;                        /**< bit:  7..15  Reserved */
    uint32_t WR_TOKENS:6;               /**< bit: 16..21  Number of AHB write commands to issue before channel is released */
    uint32_t :9;                        /**< bit: 22..30  Reserved */
    uint32_t WR_INCR:1;                 /**< bit:     31  If set the controller will increment the next burst address */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_STATIC_REG1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_STATIC_REG1_OFFSET 0x214                                         /**<  (PROV_DMA_CTRL_CH2_STATIC_REG1) Channel 2 Static Configuration Write  Offset */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_RESETVALUE 0x80010000u                                   /**<  (PROV_DMA_CTRL_CH2_STATIC_REG1) Channel 2 Static Configuration Write  Reset Value */

#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_BURST_MAX_SIZE_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_STATIC_REG1) Maximum number of bytes of an AHB write burst Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_BURST_MAX_SIZE_Msk (0x7Fu << PROV_DMA_CTRL_CH2_STATIC_REG1_WR_BURST_MAX_SIZE_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG1) Maximum number of bytes of an AHB write burst Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_BURST_MAX_SIZE(value) (PROV_DMA_CTRL_CH2_STATIC_REG1_WR_BURST_MAX_SIZE_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG1_WR_BURST_MAX_SIZE_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_TOKENS_Pos 16                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG1) Number of AHB write commands to issue before channel is released Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_TOKENS_Msk (0x3Fu << PROV_DMA_CTRL_CH2_STATIC_REG1_WR_TOKENS_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG1) Number of AHB write commands to issue before channel is released Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_TOKENS(value) (PROV_DMA_CTRL_CH2_STATIC_REG1_WR_TOKENS_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG1_WR_TOKENS_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_INCR_Pos 31                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG1) If set the controller will increment the next burst address Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_INCR_Msk (0x1u << PROV_DMA_CTRL_CH2_STATIC_REG1_WR_INCR_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG1) If set the controller will increment the next burst address Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_WR_INCR PROV_DMA_CTRL_CH2_STATIC_REG1_WR_INCR_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_STATIC_REG1_WR_INCR_Msk instead */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_MASK  0x803F007Fu                                    /**< \deprecated (PROV_DMA_CTRL_CH2_STATIC_REG1) Register MASK  (Use PROV_DMA_CTRL_CH2_STATIC_REG1_Msk instead)  */
#define PROV_DMA_CTRL_CH2_STATIC_REG1_Msk   0x803F007Fu                                    /**< (PROV_DMA_CTRL_CH2_STATIC_REG1) Register Mask  */

/* -------- PROV_DMA_CTRL_CH2_STATIC_REG2 : (PROV_DMA_CTRL Offset: 0x218) (R/W 32) Channel 2 Block Mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :16;                       /**< bit:  0..15  Reserved */
    uint32_t JOINT:1;                   /**< bit:     16  If set channel will work in joint mode   */
    uint32_t :11;                       /**< bit: 17..27  Reserved */
    uint32_t END_SWAP:2;                /**< bit: 28..29  Endianness Byte Swapping                 */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_STATIC_REG2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_STATIC_REG2_OFFSET 0x218                                         /**<  (PROV_DMA_CTRL_CH2_STATIC_REG2) Channel 2 Block Mode  Offset */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_RESETVALUE 0x10000u                                      /**<  (PROV_DMA_CTRL_CH2_STATIC_REG2) Channel 2 Block Mode  Reset Value */

