remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CH2_STATIC_REG2_JOINT_Pos 16                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) If set channel will work in joint mode Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_JOINT_Msk (0x1u << PROV_DMA_CTRL_CH2_STATIC_REG2_JOINT_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) If set channel will work in joint mode Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_JOINT PROV_DMA_CTRL_CH2_STATIC_REG2_JOINT_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_STATIC_REG2_JOINT_Msk instead */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Pos 28                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Endianness Byte Swapping Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Msk (0x3u << PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Endianness Byte Swapping Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP(value) (PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Pos))
#define   PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_0_Val 0x0u                                           /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) No Swapping  */
#define   PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_1_Val 0x1u                                           /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Swap bytes within 16 bits  */
#define   PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_2_Val 0x2u                                           /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Swap bytes within 32 bits  */
#define   PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_3_Val 0x3u                                           /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Swap bytes within 64 bits  */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_0 (PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_0_Val << PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) No Swapping Position  */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_1 (PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_1_Val << PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Swap bytes within 16 bits Position  */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_2 (PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_2_Val << PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Swap bytes within 32 bits Position  */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_3 (PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_3_Val << PROV_DMA_CTRL_CH2_STATIC_REG2_END_SWAP_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Swap bytes within 64 bits Position  */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_MASK  0x30010000u                                    /**< \deprecated (PROV_DMA_CTRL_CH2_STATIC_REG2) Register MASK  (Use PROV_DMA_CTRL_CH2_STATIC_REG2_Msk instead)  */
#define PROV_DMA_CTRL_CH2_STATIC_REG2_Msk   0x30010000u                                    /**< (PROV_DMA_CTRL_CH2_STATIC_REG2) Register Mask  */

/* -------- PROV_DMA_CTRL_CH2_STATIC_REG4 : (PROV_DMA_CTRL Offset: 0x220) (R/W 32) Channel 2 Static Configuration Peripheral -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_PERIPH_NUM:5;           /**< bit:   0..4  Number of peripheral to read from (0 if memory or no peripheral flow control) */
    uint32_t :3;                        /**< bit:   5..7  Reserved */
    uint32_t RD_PERIPH_DELAY:3;         /**< bit:  8..10  Number of cycles to wait for read request signal to update after issuing the read clear signal */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t WR_PERIPH_NUM:5;           /**< bit: 16..20  Number of peripheral to write from (0 if memory or no peripheral flow control) */
    uint32_t :3;                        /**< bit: 21..23  Reserved */
    uint32_t WR_PERIPH_DELAY:3;         /**< bit: 24..26  Number of cycles to wait for write request signal to update after issuing the write clear signal */
    uint32_t :5;                        /**< bit: 27..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_STATIC_REG4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_STATIC_REG4_OFFSET 0x220                                         /**<  (PROV_DMA_CTRL_CH2_STATIC_REG4) Channel 2 Static Configuration Peripheral  Offset */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH2_STATIC_REG4) Channel 2 Static Configuration Peripheral  Reset Value */

#define PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_NUM_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of peripheral to read from (0 if memory or no peripheral flow control) Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_NUM_Msk (0x1Fu << PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_NUM_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of peripheral to read from (0 if memory or no peripheral flow control) Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_NUM(value) (PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_NUM_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_NUM_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_DELAY_Pos 8                                              /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of cycles to wait for read request signal to update after issuing the read clear signal Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_DELAY_Msk (0x7u << PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_DELAY_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of cycles to wait for read request signal to update after issuing the read clear signal Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_DELAY(value) (PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_DELAY_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG4_RD_PERIPH_DELAY_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_NUM_Pos 16                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of peripheral to write from (0 if memory or no peripheral flow control) Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_NUM_Msk (0x1Fu << PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_NUM_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of peripheral to write from (0 if memory or no peripheral flow control) Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_NUM(value) (PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_NUM_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_NUM_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_DELAY_Pos 24                                             /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of cycles to wait for write request signal to update after issuing the write clear signal Position */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_DELAY_Msk (0x7u << PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_DELAY_Pos)  /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Number of cycles to wait for write request signal to update after issuing the write clear signal Mask */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_DELAY(value) (PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_DELAY_Msk & ((value) << PROV_DMA_CTRL_CH2_STATIC_REG4_WR_PERIPH_DELAY_Pos))
#define PROV_DMA_CTRL_CH2_STATIC_REG4_MASK  0x71F071Fu                                     /**< \deprecated (PROV_DMA_CTRL_CH2_STATIC_REG4) Register MASK  (Use PROV_DMA_CTRL_CH2_STATIC_REG4_Msk instead)  */
#define PROV_DMA_CTRL_CH2_STATIC_REG4_Msk   0x71F071Fu                                     /**< (PROV_DMA_CTRL_CH2_STATIC_REG4) Register Mask  */

/* -------- PROV_DMA_CTRL_CH2_RESRICT_REG : (PROV_DMA_CTRL Offset: 0x22c) (R/ 16) Channel 2 Restrictions Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t RD_ALLOW_FULL_FIFO:1;      /**< bit:      0  Read start address does not restrict burst size */
    uint16_t WR_ALLOW_FULL_FIFO:1;      /**< bit:      1  Write start address does not restrict burst size */
    uint16_t ALLOW_FULL_FIFO:1;         /**< bit:      2  Burst sizes can equal data buffer size, otherwise max burst is half data buffer size */
    uint16_t ALLOW_FULL_BURST:1;        /**< bit:      3  Maximum burst of 16 strobes can be used (joint mode only) */
    uint16_t ALLOW_JOINT_BURST:1;       /**< bit:      4  Joint bursts are currently active        */
    uint16_t :3;                        /**< bit:   5..7  Reserved */
    uint16_t SIMPLE_MEM:1;              /**< bit:      8  Configuration is aligned and peripherals are not used */
    uint16_t :7;                        /**< bit:  9..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_RESRICT_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_RESRICT_REG_OFFSET 0x22C                                         /**<  (PROV_DMA_CTRL_CH2_RESRICT_REG) Channel 2 Restrictions Status Register  Offset */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH2_RESRICT_REG) Channel 2 Restrictions Status Register  Reset Value */

#define PROV_DMA_CTRL_CH2_RESRICT_REG_RD_ALLOW_FULL_FIFO_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Read start address does not restrict burst size Position */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_RD_ALLOW_FULL_FIFO_Msk (0x1u << PROV_DMA_CTRL_CH2_RESRICT_REG_RD_ALLOW_FULL_FIFO_Pos)  /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Read start address does not restrict burst size Mask */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_RD_ALLOW_FULL_FIFO PROV_DMA_CTRL_CH2_RESRICT_REG_RD_ALLOW_FULL_FIFO_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_RESRICT_REG_RD_ALLOW_FULL_FIFO_Msk instead */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_WR_ALLOW_FULL_FIFO_Pos 1                                              /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Write start address does not restrict burst size Position */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_WR_ALLOW_FULL_FIFO_Msk (0x1u << PROV_DMA_CTRL_CH2_RESRICT_REG_WR_ALLOW_FULL_FIFO_Pos)  /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Write start address does not restrict burst size Mask */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_WR_ALLOW_FULL_FIFO PROV_DMA_CTRL_CH2_RESRICT_REG_WR_ALLOW_FULL_FIFO_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_RESRICT_REG_WR_ALLOW_FULL_FIFO_Msk instead */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_FIFO_Pos 2                                              /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Burst sizes can equal data buffer size, otherwise max burst is half data buffer size Position */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_FIFO_Msk (0x1u << PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_FIFO_Pos)  /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Burst sizes can equal data buffer size, otherwise max burst is half data buffer size Mask */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_FIFO PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_FIFO_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_FIFO_Msk instead */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_BURST_Pos 3                                              /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Maximum burst of 16 strobes can be used (joint mode only) Position */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_BURST_Msk (0x1u << PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_BURST_Pos)  /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Maximum burst of 16 strobes can be used (joint mode only) Mask */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_BURST PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_BURST_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_FULL_BURST_Msk instead */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_JOINT_BURST_Pos 4                                              /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Joint bursts are currently active Position */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_JOINT_BURST_Msk (0x1u << PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_JOINT_BURST_Pos)  /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Joint bursts are currently active Mask */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_JOINT_BURST PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_JOINT_BURST_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_RESRICT_REG_ALLOW_JOINT_BURST_Msk instead */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_SIMPLE_MEM_Pos 8                                              /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Configuration is aligned and peripherals are not used Position */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_SIMPLE_MEM_Msk (0x1u << PROV_DMA_CTRL_CH2_RESRICT_REG_SIMPLE_MEM_Pos)  /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Configuration is aligned and peripherals are not used Mask */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_SIMPLE_MEM PROV_DMA_CTRL_CH2_RESRICT_REG_SIMPLE_MEM_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_RESRICT_REG_SIMPLE_MEM_Msk instead */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_MASK  0x11Fu                                         /**< \deprecated (PROV_DMA_CTRL_CH2_RESRICT_REG) Register MASK  (Use PROV_DMA_CTRL_CH2_RESRICT_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH2_RESRICT_REG_Msk   0x11Fu                                         /**< (PROV_DMA_CTRL_CH2_RESRICT_REG) Register Mask  */

