remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
/* -------- PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG : (PROV_DMA_CTRL Offset: 0x238) (R/ 32) Channel 2 FIFO Fullness Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_GAP:13;                 /**< bit:  0..12  Remaining space (in bytes) in FIFO for read data */
    uint32_t :3;                        /**< bit: 13..15  Reserved */
    uint32_t WR_FULLNESS:13;            /**< bit: 16..28  Occupied space (in bytes) in FIFO by write data */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_OFFSET 0x238                                         /**<  (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Channel 2 FIFO Fullness Status Register  Offset */
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Channel 2 FIFO Fullness Status Register  Reset Value */

#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_RD_GAP_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Remaining space (in bytes) in FIFO for read data Position */
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_RD_GAP_Msk (0x1FFFu << PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_RD_GAP_Pos)  /**< (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Remaining space (in bytes) in FIFO for read data Mask */
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_RD_GAP(value) (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_RD_GAP_Msk & ((value) << PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_RD_GAP_Pos))
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_WR_FULLNESS_Pos 16                                             /**< (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Occupied space (in bytes) in FIFO by write data Position */
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_WR_FULLNESS_Msk (0x1FFFu << PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_WR_FULLNESS_Pos)  /**< (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Occupied space (in bytes) in FIFO by write data Mask */
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_WR_FULLNESS(value) (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_WR_FULLNESS_Msk & ((value) << PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_WR_FULLNESS_Pos))
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_MASK 0x1FFF1FFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Register MASK  (Use PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_Msk 0x1FFF1FFFu                                    /**< (PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH2_CH_ENABLE_REG : (PROV_DMA_CTRL Offset: 0x240) (R/W 8) Channel 2 Channel Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH2_CH_ENABLE_REG:1;       /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_CH_ENABLE_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_CH_ENABLE_REG_OFFSET 0x240                                         /**<  (PROV_DMA_CTRL_CH2_CH_ENABLE_REG) Channel 2 Channel Enable Register  Offset */
#define PROV_DMA_CTRL_CH2_CH_ENABLE_REG_RESETVALUE 0x01u                                         /**<  (PROV_DMA_CTRL_CH2_CH_ENABLE_REG) Channel 2 Channel Enable Register  Reset Value */

#define PROV_DMA_CTRL_CH2_CH_ENABLE_REG_CH2_CH_ENABLE_REG_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_CH_ENABLE_REG)  Position */
#define PROV_DMA_CTRL_CH2_CH_ENABLE_REG_CH2_CH_ENABLE_REG_Msk (0x1u << PROV_DMA_CTRL_CH2_CH_ENABLE_REG_CH2_CH_ENABLE_REG_Pos)  /**< (PROV_DMA_CTRL_CH2_CH_ENABLE_REG)  Mask */
#define PROV_DMA_CTRL_CH2_CH_ENABLE_REG_CH2_CH_ENABLE_REG PROV_DMA_CTRL_CH2_CH_ENABLE_REG_CH2_CH_ENABLE_REG_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_CH_ENABLE_REG_CH2_CH_ENABLE_REG_Msk instead */
#define PROV_DMA_CTRL_CH2_CH_ENABLE_REG_MASK 0x01u                                          /**< \deprecated (PROV_DMA_CTRL_CH2_CH_ENABLE_REG) Register MASK  (Use PROV_DMA_CTRL_CH2_CH_ENABLE_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH2_CH_ENABLE_REG_Msk 0x01u                                          /**< (PROV_DMA_CTRL_CH2_CH_ENABLE_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH2_CH_START_REG : (PROV_DMA_CTRL Offset: 0x244) (/W 8) Channel 2 Channel Start Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH2_CH_START_REG:1;        /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH2_CH_START_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH2_CH_START_REG_OFFSET 0x244                                         /**<  (PROV_DMA_CTRL_CH2_CH_START_REG) Channel 2 Channel Start Register  Offset */
#define PROV_DMA_CTRL_CH2_CH_START_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH2_CH_START_REG) Channel 2 Channel Start Register  Reset Value */

#define PROV_DMA_CTRL_CH2_CH_START_REG_CH2_CH_START_REG_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_CH_START_REG)  Position */
#define PROV_DMA_CTRL_CH2_CH_START_REG_CH2_CH_START_REG_Msk (0x1u << PROV_DMA_CTRL_CH2_CH_START_REG_CH2_CH_START_REG_Pos)  /**< (PROV_DMA_CTRL_CH2_CH_START_REG)  Mask */
#define PROV_DMA_CTRL_CH2_CH_START_REG_CH2_CH_START_REG PROV_DMA_CTRL_CH2_CH_START_REG_CH2_CH_START_REG_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_CH_START_REG_CH2_CH_START_REG_Msk instead */
#define PROV_DMA_CTRL_CH2_CH_START_REG_MASK 0x01u                                          /**< \deprecated (PROV_DMA_CTRL_CH2_CH_START_REG) Register MASK  (Use PROV_DMA_CTRL_CH2_CH_START_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH2_CH_START_REG_Msk  0x01u                                          /**< (PROV_DMA_CTRL_CH2_CH_START_REG) Register Mask  */

