remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_OFFSET 0x2AC                                         /**<  (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Channel 2 Interrupt Status  Offset */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Channel 2 Interrupt Status  Reset Value */

#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_CH_END_Pos 0                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Indicates an unserviced channel end interrupt Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_CH_END_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_CH_END_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Indicates an unserviced channel end interrupt Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_CH_END PROV_DMA_CTRL_CH2_INT_STATUS_REG_CH_END_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_CH_END_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_RD_SLVERR_Pos 1                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) AHB read slave error Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_RD_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_RD_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) AHB read slave error Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_RD_SLVERR PROV_DMA_CTRL_CH2_INT_STATUS_REG_RD_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_RD_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_WR_SLVERR_Pos 2                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) AHB write slave error Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_WR_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_WR_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) AHB write slave error Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_WR_SLVERR PROV_DMA_CTRL_CH2_INT_STATUS_REG_WR_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_WR_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_OVERFLOW_Pos 3                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) FIFO has been overflown Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_OVERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_OVERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) FIFO has been overflown Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_OVERFLOW PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_OVERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_OVERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_UNDERFLOW_Pos 4                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) FIFO has been underflown Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_UNDERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_UNDERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) FIFO has been underflown Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_UNDERFLOW PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_UNDERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_FIFO_UNDERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_RD_Pos 5                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Read timeout on AHB bus (timeout value fixed at 1024 cycles) Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_RD_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_RD_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Read timeout on AHB bus (timeout value fixed at 1024 cycles) Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_RD PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_RD_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_RD_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_WR_Pos 6                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Write timeout on AHB bus (timeout value fixed at 1024 cycles) Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_WR_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_WR_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Write timeout on AHB bus (timeout value fixed at 1024 cycles) Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_WR PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_WR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_TIMEOUT_WR_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_WDT_Pos 7                                              /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Channel active but did not start a burst for 2048 cycles Position */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_WDT_Msk (0x1u << PROV_DMA_CTRL_CH2_INT_STATUS_REG_WDT_Pos)  /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Channel active but did not start a burst for 2048 cycles Mask */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_WDT PROV_DMA_CTRL_CH2_INT_STATUS_REG_WDT_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_WDT_Msk instead */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_MASK 0xFFu                                          /**< \deprecated (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Register MASK  (Use PROV_DMA_CTRL_CH2_INT_STATUS_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH2_INT_STATUS_REG_Msk 0xFFu                                          /**< (PROV_DMA_CTRL_CH2_INT_STATUS_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH3_CMD_REG0 : (PROV_DMA_CTRL Offset: 0x300) (R/W 32) Channel 3 First Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_START_ADDR:32;          /**< bit:  0..31  Start Address of Read Buffer             */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH3_CMD_REG0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH3_CMD_REG0_OFFSET   0x300                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG0) Channel 3 First Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH3_CMD_REG0_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG0) Channel 3 First Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH3_CMD_REG0_RD_START_ADDR_Pos 0                                              /**< (PROV_DMA_CTRL_CH3_CMD_REG0) Start Address of Read Buffer Position */
#define PROV_DMA_CTRL_CH3_CMD_REG0_RD_START_ADDR_Msk (0xFFFFFFFFu << PROV_DMA_CTRL_CH3_CMD_REG0_RD_START_ADDR_Pos)  /**< (PROV_DMA_CTRL_CH3_CMD_REG0) Start Address of Read Buffer Mask */
#define PROV_DMA_CTRL_CH3_CMD_REG0_RD_START_ADDR(value) (PROV_DMA_CTRL_CH3_CMD_REG0_RD_START_ADDR_Msk & ((value) << PROV_DMA_CTRL_CH3_CMD_REG0_RD_START_ADDR_Pos))
#define PROV_DMA_CTRL_CH3_CMD_REG0_MASK     0xFFFFFFFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH3_CMD_REG0) Register MASK  (Use PROV_DMA_CTRL_CH3_CMD_REG0_Msk instead)  */
#define PROV_DMA_CTRL_CH3_CMD_REG0_Msk      0xFFFFFFFFu                                    /**< (PROV_DMA_CTRL_CH3_CMD_REG0) Register Mask  */

/* -------- PROV_DMA_CTRL_CH3_CMD_REG1 : (PROV_DMA_CTRL Offset: 0x304) (R/W 32) Channel 3 Second Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WR_START_ADDR:32;          /**< bit:  0..31  Start Address of Write Buffer            */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH3_CMD_REG1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

