remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CH3_CMD_REG1_OFFSET   0x304                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG1) Channel 3 Second Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH3_CMD_REG1_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG1) Channel 3 Second Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH3_CMD_REG1_WR_START_ADDR_Pos 0                                              /**< (PROV_DMA_CTRL_CH3_CMD_REG1) Start Address of Write Buffer Position */
#define PROV_DMA_CTRL_CH3_CMD_REG1_WR_START_ADDR_Msk (0xFFFFFFFFu << PROV_DMA_CTRL_CH3_CMD_REG1_WR_START_ADDR_Pos)  /**< (PROV_DMA_CTRL_CH3_CMD_REG1) Start Address of Write Buffer Mask */
#define PROV_DMA_CTRL_CH3_CMD_REG1_WR_START_ADDR(value) (PROV_DMA_CTRL_CH3_CMD_REG1_WR_START_ADDR_Msk & ((value) << PROV_DMA_CTRL_CH3_CMD_REG1_WR_START_ADDR_Pos))
#define PROV_DMA_CTRL_CH3_CMD_REG1_MASK     0xFFFFFFFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH3_CMD_REG1) Register MASK  (Use PROV_DMA_CTRL_CH3_CMD_REG1_Msk instead)  */
#define PROV_DMA_CTRL_CH3_CMD_REG1_Msk      0xFFFFFFFFu                                    /**< (PROV_DMA_CTRL_CH3_CMD_REG1) Register Mask  */

/* -------- PROV_DMA_CTRL_CH3_CMD_REG2 : (PROV_DMA_CTRL Offset: 0x308) (R/W 16) Channel 3 Third Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t BUFFER_SIZE:13;            /**< bit:  0..12  Size (in Bytes) of Buffer to Transfer    */
    uint16_t :3;                        /**< bit: 13..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH3_CMD_REG2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH3_CMD_REG2_OFFSET   0x308                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG2) Channel 3 Third Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH3_CMD_REG2_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG2) Channel 3 Third Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH3_CMD_REG2_BUFFER_SIZE_Pos 0                                              /**< (PROV_DMA_CTRL_CH3_CMD_REG2) Size (in Bytes) of Buffer to Transfer Position */
#define PROV_DMA_CTRL_CH3_CMD_REG2_BUFFER_SIZE_Msk (0x1FFFu << PROV_DMA_CTRL_CH3_CMD_REG2_BUFFER_SIZE_Pos)  /**< (PROV_DMA_CTRL_CH3_CMD_REG2) Size (in Bytes) of Buffer to Transfer Mask */
#define PROV_DMA_CTRL_CH3_CMD_REG2_BUFFER_SIZE(value) (PROV_DMA_CTRL_CH3_CMD_REG2_BUFFER_SIZE_Msk & ((value) << PROV_DMA_CTRL_CH3_CMD_REG2_BUFFER_SIZE_Pos))
#define PROV_DMA_CTRL_CH3_CMD_REG2_MASK     0x1FFFu                                        /**< \deprecated (PROV_DMA_CTRL_CH3_CMD_REG2) Register MASK  (Use PROV_DMA_CTRL_CH3_CMD_REG2_Msk instead)  */
#define PROV_DMA_CTRL_CH3_CMD_REG2_Msk      0x1FFFu                                        /**< (PROV_DMA_CTRL_CH3_CMD_REG2) Register Mask  */

/* -------- PROV_DMA_CTRL_CH3_CMD_REG3 : (PROV_DMA_CTRL Offset: 0x30c) (R/W 32) Channel 3 Fourth Line Channel Command -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CMD_SET_INT:1;             /**< bit:      0  Active High Interrupt Enable once buffer has been transfered */
    uint32_t CMD_LAST:1;                /**< bit:      1  If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR */
    uint32_t CMD_NEXT_ADDR:30;          /**< bit:  2..31  Address of next command if CMD_LAST is not set */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH3_CMD_REG3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CH3_CMD_REG3_OFFSET   0x30C                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG3) Channel 3 Fourth Line Channel Command  Offset */
#define PROV_DMA_CTRL_CH3_CMD_REG3_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CH3_CMD_REG3) Channel 3 Fourth Line Channel Command  Reset Value */

#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_SET_INT_Pos 0                                              /**< (PROV_DMA_CTRL_CH3_CMD_REG3) Active High Interrupt Enable once buffer has been transfered Position */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_SET_INT_Msk (0x1u << PROV_DMA_CTRL_CH3_CMD_REG3_CMD_SET_INT_Pos)  /**< (PROV_DMA_CTRL_CH3_CMD_REG3) Active High Interrupt Enable once buffer has been transfered Mask */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_SET_INT PROV_DMA_CTRL_CH3_CMD_REG3_CMD_SET_INT_Msk     /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_CMD_REG3_CMD_SET_INT_Msk instead */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_LAST_Pos 1                                              /**< (PROV_DMA_CTRL_CH3_CMD_REG3) If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR Position */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_LAST_Msk (0x1u << PROV_DMA_CTRL_CH3_CMD_REG3_CMD_LAST_Pos)  /**< (PROV_DMA_CTRL_CH3_CMD_REG3) If set, channel stops when buffer done, otherwise load from CMD_NEXT_ADDR Mask */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_LAST PROV_DMA_CTRL_CH3_CMD_REG3_CMD_LAST_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_CMD_REG3_CMD_LAST_Msk instead */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_NEXT_ADDR_Pos 2                                              /**< (PROV_DMA_CTRL_CH3_CMD_REG3) Address of next command if CMD_LAST is not set Position */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_NEXT_ADDR_Msk (0x3FFFFFFFu << PROV_DMA_CTRL_CH3_CMD_REG3_CMD_NEXT_ADDR_Pos)  /**< (PROV_DMA_CTRL_CH3_CMD_REG3) Address of next command if CMD_LAST is not set Mask */
#define PROV_DMA_CTRL_CH3_CMD_REG3_CMD_NEXT_ADDR(value) (PROV_DMA_CTRL_CH3_CMD_REG3_CMD_NEXT_ADDR_Msk & ((value) << PROV_DMA_CTRL_CH3_CMD_REG3_CMD_NEXT_ADDR_Pos))
#define PROV_DMA_CTRL_CH3_CMD_REG3_MASK     0xFFFFFFFFu                                    /**< \deprecated (PROV_DMA_CTRL_CH3_CMD_REG3) Register MASK  (Use PROV_DMA_CTRL_CH3_CMD_REG3_Msk instead)  */
#define PROV_DMA_CTRL_CH3_CMD_REG3_Msk      0xFFFFFFFFu                                    /**< (PROV_DMA_CTRL_CH3_CMD_REG3) Register Mask  */

/* -------- PROV_DMA_CTRL_CH3_STATIC_REG0 : (PROV_DMA_CTRL Offset: 0x310) (R/W 32) Channel 3 Static Configuration Read -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RD_BURST_MAX_SIZE:7;       /**< bit:   0..6  Maximum number of bytes of an AHB read burst */
    uint32_t :9;                        /**< bit:  7..15  Reserved */
    uint32_t RD_TOKENS:6;               /**< bit: 16..21  Number of AHB read commands to issue before channel is released */
    uint32_t :9;                        /**< bit: 22..30  Reserved */
    uint32_t RD_INCR:1;                 /**< bit:     31  If set the controller will increment the next burst address */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH3_STATIC_REG0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

