remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_CH_END_Pos 0                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables end of channel interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_CH_END_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_CH_END_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables end of channel interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_CH_END PROV_DMA_CTRL_CH3_INT_ENABLE_REG_CH_END_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_CH_END_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_RD_SLVERR_Pos 1                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB read slave error interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_RD_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_RD_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB read slave error interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_RD_SLVERR PROV_DMA_CTRL_CH3_INT_ENABLE_REG_RD_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_RD_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WR_SLVERR_Pos 2                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB write slave error interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WR_SLVERR_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WR_SLVERR_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB write slave error interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WR_SLVERR PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WR_SLVERR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WR_SLVERR_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_OVERFLOW_Pos 3                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables FIFO overflow interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_OVERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_OVERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables FIFO overflow interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_OVERFLOW PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_OVERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_OVERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_UNDERFLOW_Pos 4                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables FIFO underflow interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_UNDERFLOW_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_UNDERFLOW_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables FIFO underflow interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_UNDERFLOW PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_UNDERFLOW_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_FIFO_UNDERFLOW_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_RD_Pos 5                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB Read timeout interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_RD_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_RD_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB Read timeout interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_RD PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_RD_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_RD_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_WR_Pos 6                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB Write timeout interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_WR_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_WR_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables AHB Write timeout interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_WR PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_WR_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_TIMEOUT_WR_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WDT_Pos 7                                              /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables WDT interrupt Position */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WDT_Msk (0x1u << PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WDT_Pos)  /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Enables WDT interrupt Mask */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WDT PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WDT_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_WDT_Msk instead */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_MASK 0xFFu                                          /**< \deprecated (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Register MASK  (Use PROV_DMA_CTRL_CH3_INT_ENABLE_REG_Msk instead)  */
#define PROV_DMA_CTRL_CH3_INT_ENABLE_REG_Msk 0xFFu                                          /**< (PROV_DMA_CTRL_CH3_INT_ENABLE_REG) Register Mask  */

/* -------- PROV_DMA_CTRL_CH3_INT_STATUS_REG : (PROV_DMA_CTRL Offset: 0x3ac) (R/W 8) Channel 3 Interrupt Status -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH_END:1;                  /**< bit:      0  Indicates an unserviced channel end interrupt */
    uint8_t  RD_SLVERR:1;               /**< bit:      1  AHB read slave error                     */
    uint8_t  WR_SLVERR:1;               /**< bit:      2  AHB write slave error                    */
    uint8_t  FIFO_OVERFLOW:1;           /**< bit:      3  FIFO has been overflown                  */
    uint8_t  FIFO_UNDERFLOW:1;          /**< bit:      4  FIFO has been underflown                 */
    uint8_t  TIMEOUT_RD:1;              /**< bit:      5  Read timeout on AHB bus (timeout value fixed at 1024 cycles) */
    uint8_t  TIMEOUT_WR:1;              /**< bit:      6  Write timeout on AHB bus (timeout value fixed at 1024 cycles) */
    uint8_t  WDT:1;                     /**< bit:      7  Channel active but did not start a burst for 2048 cycles */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CH3_INT_STATUS_REG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

