remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CORE_INT_STATUS_OFFSET 0x800                                         /**<  (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates which channels caused interrupt  Offset */
#define PROV_DMA_CTRL_CORE_INT_STATUS_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates which channels caused interrupt  Reset Value */

#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_0_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 0 caused interrupt Position */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_0_Msk (0x1u << PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_0_Pos)  /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 0 caused interrupt Mask */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_0 PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_0_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_0_Msk instead */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_1_Pos 1                                              /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 1 caused interrupt Position */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_1_Msk (0x1u << PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_1_Pos)  /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 1 caused interrupt Mask */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_1 PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_1_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_1_Msk instead */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_2_Pos 2                                              /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 2 caused interrupt Position */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_2_Msk (0x1u << PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_2_Pos)  /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 2 caused interrupt Mask */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_2 PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_2_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_2_Msk instead */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_3_Pos 3                                              /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 3 caused interrupt Position */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_3_Msk (0x1u << PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_3_Pos)  /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Indicates channel 3 caused interrupt Mask */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_3 PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_3_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_3_Msk instead */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL__Pos 0                                              /**< (PROV_DMA_CTRL_CORE_INT_STATUS Position) Indicates channel 3 caused interrupt */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL__Msk (0xFu << PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL__Pos)  /**< (PROV_DMA_CTRL_CORE_INT_STATUS Mask) CHANNEL_ */
#define PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL_(value) (PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL__Msk & ((value) << PROV_DMA_CTRL_CORE_INT_STATUS_CHANNEL__Pos))  
#define PROV_DMA_CTRL_CORE_INT_STATUS_MASK  0x0Fu                                          /**< \deprecated (PROV_DMA_CTRL_CORE_INT_STATUS) Register MASK  (Use PROV_DMA_CTRL_CORE_INT_STATUS_Msk instead)  */
#define PROV_DMA_CTRL_CORE_INT_STATUS_Msk   0x0Fu                                          /**< (PROV_DMA_CTRL_CORE_INT_STATUS) Register Mask  */

/* -------- PROV_DMA_CTRL_CORE_JOINT_MODE : (PROV_DMA_CTRL Offset: 0x830) (R/W 8) If set, core works in joint mode -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CORE_JOINT_MODE:1;         /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CORE_JOINT_MODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CORE_JOINT_MODE_OFFSET 0x830                                         /**<  (PROV_DMA_CTRL_CORE_JOINT_MODE) If set, core works in joint mode  Offset */
#define PROV_DMA_CTRL_CORE_JOINT_MODE_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CORE_JOINT_MODE) If set, core works in joint mode  Reset Value */

#define PROV_DMA_CTRL_CORE_JOINT_MODE_CORE_JOINT_MODE_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_JOINT_MODE)  Position */
#define PROV_DMA_CTRL_CORE_JOINT_MODE_CORE_JOINT_MODE_Msk (0x1u << PROV_DMA_CTRL_CORE_JOINT_MODE_CORE_JOINT_MODE_Pos)  /**< (PROV_DMA_CTRL_CORE_JOINT_MODE)  Mask */
#define PROV_DMA_CTRL_CORE_JOINT_MODE_CORE_JOINT_MODE PROV_DMA_CTRL_CORE_JOINT_MODE_CORE_JOINT_MODE_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_JOINT_MODE_CORE_JOINT_MODE_Msk instead */
#define PROV_DMA_CTRL_CORE_JOINT_MODE_MASK  0x01u                                          /**< \deprecated (PROV_DMA_CTRL_CORE_JOINT_MODE) Register MASK  (Use PROV_DMA_CTRL_CORE_JOINT_MODE_Msk instead)  */
#define PROV_DMA_CTRL_CORE_JOINT_MODE_Msk   0x01u                                          /**< (PROV_DMA_CTRL_CORE_JOINT_MODE) Register Mask  */

/* -------- PROV_DMA_CTRL_CORE_PRIORITY : (PROV_DMA_CTRL Offset: 0x838) (R/W 16) Core Priority Channels -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t RD_PRIO_TOP_NUM:3;         /**< bit:   0..2  Core Read Top Priority Channel Number    */
    uint16_t RD_PRIO_TOP:1;             /**< bit:      3  Core Read Top Priority Enable            */
    uint16_t RD_PRIO_HIGH_NUM:3;        /**< bit:   4..6  Core Read High Priority Channel Number   */
    uint16_t RD_PRIO_HIGH:1;            /**< bit:      7  Core Read High Priority Enable           */
    uint16_t WR_PRIO_TOP_NUM:3;         /**< bit:  8..10  Core Write Top Priority Channel Number   */
    uint16_t WR_PRIO_TOP:1;             /**< bit:     11  Core Write Top Priority Enable           */
    uint16_t WR_PRIO_HIGH_NUM:3;        /**< bit: 12..14  Core Write High Priority Channel Number  */
    uint16_t WR_PRIO_HIGH:1;            /**< bit:     15  Core Write High Priority Enable          */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CORE_PRIORITY_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CORE_PRIORITY_OFFSET  0x838                                         /**<  (PROV_DMA_CTRL_CORE_PRIORITY) Core Priority Channels  Offset */
#define PROV_DMA_CTRL_CORE_PRIORITY_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CORE_PRIORITY) Core Priority Channels  Reset Value */

#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_NUM_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read Top Priority Channel Number Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_NUM_Msk (0x7u << PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_NUM_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read Top Priority Channel Number Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_NUM(value) (PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_NUM_Msk & ((value) << PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_NUM_Pos))
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_Pos 3                                              /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read Top Priority Enable Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_Msk (0x1u << PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read Top Priority Enable Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_TOP_Msk instead */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_NUM_Pos 4                                              /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read High Priority Channel Number Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_NUM_Msk (0x7u << PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_NUM_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read High Priority Channel Number Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_NUM(value) (PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_NUM_Msk & ((value) << PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_NUM_Pos))
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_Pos 7                                              /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read High Priority Enable Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_Msk (0x1u << PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Read High Priority Enable Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_PRIORITY_RD_PRIO_HIGH_Msk instead */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_NUM_Pos 8                                              /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write Top Priority Channel Number Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_NUM_Msk (0x7u << PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_NUM_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write Top Priority Channel Number Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_NUM(value) (PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_NUM_Msk & ((value) << PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_NUM_Pos))
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_Pos 11                                             /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write Top Priority Enable Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_Msk (0x1u << PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write Top Priority Enable Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_TOP_Msk instead */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_NUM_Pos 12                                             /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write High Priority Channel Number Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_NUM_Msk (0x7u << PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_NUM_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write High Priority Channel Number Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_NUM(value) (PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_NUM_Msk & ((value) << PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_NUM_Pos))
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_Pos 15                                             /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write High Priority Enable Position */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_Msk (0x1u << PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_Pos)  /**< (PROV_DMA_CTRL_CORE_PRIORITY) Core Write High Priority Enable Mask */
#define PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_Msk   /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_PRIORITY_WR_PRIO_HIGH_Msk instead */
#define PROV_DMA_CTRL_CORE_PRIORITY_MASK    0xFFFFu                                        /**< \deprecated (PROV_DMA_CTRL_CORE_PRIORITY) Register MASK  (Use PROV_DMA_CTRL_CORE_PRIORITY_Msk instead)  */
#define PROV_DMA_CTRL_CORE_PRIORITY_Msk     0xFFFFu                                        /**< (PROV_DMA_CTRL_CORE_PRIORITY) Register Mask  */

/* -------- PROV_DMA_CTRL_CORE_CLKDIV : (PROV_DMA_CTRL Offset: 0x840) (R/W 8) Ratio between main clock and core clock -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CORE_CLKDIV:4;             /**< bit:   0..3                                           */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CORE_CLKDIV_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CORE_CLKDIV_OFFSET    0x840                                         /**<  (PROV_DMA_CTRL_CORE_CLKDIV) Ratio between main clock and core clock  Offset */
#define PROV_DMA_CTRL_CORE_CLKDIV_RESETVALUE 0x01u                                         /**<  (PROV_DMA_CTRL_CORE_CLKDIV) Ratio between main clock and core clock  Reset Value */

