remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CORE_CLKDIV_CORE_CLKDIV_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_CLKDIV)  Position */
#define PROV_DMA_CTRL_CORE_CLKDIV_CORE_CLKDIV_Msk (0xFu << PROV_DMA_CTRL_CORE_CLKDIV_CORE_CLKDIV_Pos)  /**< (PROV_DMA_CTRL_CORE_CLKDIV)  Mask */
#define PROV_DMA_CTRL_CORE_CLKDIV_CORE_CLKDIV(value) (PROV_DMA_CTRL_CORE_CLKDIV_CORE_CLKDIV_Msk & ((value) << PROV_DMA_CTRL_CORE_CLKDIV_CORE_CLKDIV_Pos))
#define PROV_DMA_CTRL_CORE_CLKDIV_MASK      0x0Fu                                          /**< \deprecated (PROV_DMA_CTRL_CORE_CLKDIV) Register MASK  (Use PROV_DMA_CTRL_CORE_CLKDIV_Msk instead)  */
#define PROV_DMA_CTRL_CORE_CLKDIV_Msk       0x0Fu                                          /**< (PROV_DMA_CTRL_CORE_CLKDIV) Register Mask  */

/* -------- PROV_DMA_CTRL_CORE_CH_START : (PROV_DMA_CTRL Offset: 0x848) (/W 8) Channel Start -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CH_0:1;                    /**< bit:      0  Starts Channel 0                         */
    uint8_t  CH_1:1;                    /**< bit:      1  Starts Channel 1                         */
    uint8_t  CH_2:1;                    /**< bit:      2  Starts Channel 2                         */
    uint8_t  CH_3:1;                    /**< bit:      3  Starts Channel 3                         */
    uint8_t  :4;                        /**< bit:   4..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint8_t  CH_:4;                     /**< bit:   0..3  Starts Channel 3                         */
    uint8_t  :4;                        /**< bit:   4..7 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CORE_CH_START_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CORE_CH_START_OFFSET  0x848                                         /**<  (PROV_DMA_CTRL_CORE_CH_START) Channel Start  Offset */
#define PROV_DMA_CTRL_CORE_CH_START_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_CORE_CH_START) Channel Start  Reset Value */

#define PROV_DMA_CTRL_CORE_CH_START_CH_0_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 0 Position */
#define PROV_DMA_CTRL_CORE_CH_START_CH_0_Msk (0x1u << PROV_DMA_CTRL_CORE_CH_START_CH_0_Pos)  /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 0 Mask */
#define PROV_DMA_CTRL_CORE_CH_START_CH_0    PROV_DMA_CTRL_CORE_CH_START_CH_0_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_CH_START_CH_0_Msk instead */
#define PROV_DMA_CTRL_CORE_CH_START_CH_1_Pos 1                                              /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 1 Position */
#define PROV_DMA_CTRL_CORE_CH_START_CH_1_Msk (0x1u << PROV_DMA_CTRL_CORE_CH_START_CH_1_Pos)  /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 1 Mask */
#define PROV_DMA_CTRL_CORE_CH_START_CH_1    PROV_DMA_CTRL_CORE_CH_START_CH_1_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_CH_START_CH_1_Msk instead */
#define PROV_DMA_CTRL_CORE_CH_START_CH_2_Pos 2                                              /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 2 Position */
#define PROV_DMA_CTRL_CORE_CH_START_CH_2_Msk (0x1u << PROV_DMA_CTRL_CORE_CH_START_CH_2_Pos)  /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 2 Mask */
#define PROV_DMA_CTRL_CORE_CH_START_CH_2    PROV_DMA_CTRL_CORE_CH_START_CH_2_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_CH_START_CH_2_Msk instead */
#define PROV_DMA_CTRL_CORE_CH_START_CH_3_Pos 3                                              /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 3 Position */
#define PROV_DMA_CTRL_CORE_CH_START_CH_3_Msk (0x1u << PROV_DMA_CTRL_CORE_CH_START_CH_3_Pos)  /**< (PROV_DMA_CTRL_CORE_CH_START) Starts Channel 3 Mask */
#define PROV_DMA_CTRL_CORE_CH_START_CH_3    PROV_DMA_CTRL_CORE_CH_START_CH_3_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_CH_START_CH_3_Msk instead */
#define PROV_DMA_CTRL_CORE_CH_START_CH__Pos 0                                              /**< (PROV_DMA_CTRL_CORE_CH_START Position) Starts Channel 3 */
#define PROV_DMA_CTRL_CORE_CH_START_CH__Msk (0xFu << PROV_DMA_CTRL_CORE_CH_START_CH__Pos)  /**< (PROV_DMA_CTRL_CORE_CH_START Mask) CH_ */
#define PROV_DMA_CTRL_CORE_CH_START_CH_(value) (PROV_DMA_CTRL_CORE_CH_START_CH__Msk & ((value) << PROV_DMA_CTRL_CORE_CH_START_CH__Pos))  
#define PROV_DMA_CTRL_CORE_CH_START_MASK    0x0Fu                                          /**< \deprecated (PROV_DMA_CTRL_CORE_CH_START) Register MASK  (Use PROV_DMA_CTRL_CORE_CH_START_Msk instead)  */
#define PROV_DMA_CTRL_CORE_CH_START_Msk     0x0Fu                                          /**< (PROV_DMA_CTRL_CORE_CH_START) Register Mask  */

/* -------- PROV_DMA_CTRL_PERIPH_RX_CTRL : (PROV_DMA_CTRL Offset: 0x850) (R/W 32) Direct control of peripheral RX request -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t RX_REQ:31;                 /**< bit:  1..31  Allows direct control of the peripheral RX request bus */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_PERIPH_RX_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_PERIPH_RX_CTRL_OFFSET 0x850                                         /**<  (PROV_DMA_CTRL_PERIPH_RX_CTRL) Direct control of peripheral RX request  Offset */
#define PROV_DMA_CTRL_PERIPH_RX_CTRL_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_PERIPH_RX_CTRL) Direct control of peripheral RX request  Reset Value */

#define PROV_DMA_CTRL_PERIPH_RX_CTRL_RX_REQ_Pos 1                                              /**< (PROV_DMA_CTRL_PERIPH_RX_CTRL) Allows direct control of the peripheral RX request bus Position */
#define PROV_DMA_CTRL_PERIPH_RX_CTRL_RX_REQ_Msk (0x7FFFFFFFu << PROV_DMA_CTRL_PERIPH_RX_CTRL_RX_REQ_Pos)  /**< (PROV_DMA_CTRL_PERIPH_RX_CTRL) Allows direct control of the peripheral RX request bus Mask */
#define PROV_DMA_CTRL_PERIPH_RX_CTRL_RX_REQ(value) (PROV_DMA_CTRL_PERIPH_RX_CTRL_RX_REQ_Msk & ((value) << PROV_DMA_CTRL_PERIPH_RX_CTRL_RX_REQ_Pos))
#define PROV_DMA_CTRL_PERIPH_RX_CTRL_MASK   0xFFFFFFFEu                                    /**< \deprecated (PROV_DMA_CTRL_PERIPH_RX_CTRL) Register MASK  (Use PROV_DMA_CTRL_PERIPH_RX_CTRL_Msk instead)  */
#define PROV_DMA_CTRL_PERIPH_RX_CTRL_Msk    0xFFFFFFFEu                                    /**< (PROV_DMA_CTRL_PERIPH_RX_CTRL) Register Mask  */

/* -------- PROV_DMA_CTRL_PERIPH_TX_CTRL : (PROV_DMA_CTRL Offset: 0x860) (R/W 32) Direct control of peripheral TX request -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t TX_REQ:31;                 /**< bit:  1..31  Allows direct control of the peripheral TX request bus */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_PERIPH_TX_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

