remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_PERIPH_TX_CTRL_OFFSET 0x860                                         /**<  (PROV_DMA_CTRL_PERIPH_TX_CTRL) Direct control of peripheral TX request  Offset */
#define PROV_DMA_CTRL_PERIPH_TX_CTRL_RESETVALUE 0x00u                                         /**<  (PROV_DMA_CTRL_PERIPH_TX_CTRL) Direct control of peripheral TX request  Reset Value */

#define PROV_DMA_CTRL_PERIPH_TX_CTRL_TX_REQ_Pos 1                                              /**< (PROV_DMA_CTRL_PERIPH_TX_CTRL) Allows direct control of the peripheral TX request bus Position */
#define PROV_DMA_CTRL_PERIPH_TX_CTRL_TX_REQ_Msk (0x7FFFFFFFu << PROV_DMA_CTRL_PERIPH_TX_CTRL_TX_REQ_Pos)  /**< (PROV_DMA_CTRL_PERIPH_TX_CTRL) Allows direct control of the peripheral TX request bus Mask */
#define PROV_DMA_CTRL_PERIPH_TX_CTRL_TX_REQ(value) (PROV_DMA_CTRL_PERIPH_TX_CTRL_TX_REQ_Msk & ((value) << PROV_DMA_CTRL_PERIPH_TX_CTRL_TX_REQ_Pos))
#define PROV_DMA_CTRL_PERIPH_TX_CTRL_MASK   0xFFFFFFFEu                                    /**< \deprecated (PROV_DMA_CTRL_PERIPH_TX_CTRL) Register MASK  (Use PROV_DMA_CTRL_PERIPH_TX_CTRL_Msk instead)  */
#define PROV_DMA_CTRL_PERIPH_TX_CTRL_Msk    0xFFFFFFFEu                                    /**< (PROV_DMA_CTRL_PERIPH_TX_CTRL) Register Mask  */

/* -------- PROV_DMA_CTRL_CORE_IDLE : (PROV_DMA_CTRL Offset: 0x8d0) (R/ 8) Indicates all channels have stopped and transactions have completed -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CORE_IDLE:1;               /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CORE_IDLE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CORE_IDLE_OFFSET      0x8D0                                         /**<  (PROV_DMA_CTRL_CORE_IDLE) Indicates all channels have stopped and transactions have completed  Offset */
#define PROV_DMA_CTRL_CORE_IDLE_RESETVALUE  0x00u                                         /**<  (PROV_DMA_CTRL_CORE_IDLE) Indicates all channels have stopped and transactions have completed  Reset Value */

#define PROV_DMA_CTRL_CORE_IDLE_CORE_IDLE_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_IDLE)  Position */
#define PROV_DMA_CTRL_CORE_IDLE_CORE_IDLE_Msk (0x1u << PROV_DMA_CTRL_CORE_IDLE_CORE_IDLE_Pos)  /**< (PROV_DMA_CTRL_CORE_IDLE)  Mask */
#define PROV_DMA_CTRL_CORE_IDLE_CORE_IDLE   PROV_DMA_CTRL_CORE_IDLE_CORE_IDLE_Msk          /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_IDLE_CORE_IDLE_Msk instead */
#define PROV_DMA_CTRL_CORE_IDLE_MASK        0x01u                                          /**< \deprecated (PROV_DMA_CTRL_CORE_IDLE) Register MASK  (Use PROV_DMA_CTRL_CORE_IDLE_Msk instead)  */
#define PROV_DMA_CTRL_CORE_IDLE_Msk         0x01u                                          /**< (PROV_DMA_CTRL_CORE_IDLE) Register Mask  */

/* -------- PROV_DMA_CTRL_USER_DEF_STATUS : (PROV_DMA_CTRL Offset: 0x8e0) (R/ 32) User Defined Configurations -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t INT_NUM:4;                 /**< bit:   0..3  Number of bits in interrupt bus          */
    uint32_t :1;                        /**< bit:      4  Reserved */
    uint32_t DUAL_CORE:1;               /**< bit:      5  If set the design has two cores          */
    uint32_t IC:1;                      /**< bit:      6  If set an AHB matrix is used             */
    uint32_t IC_DUAL_PORT:1;            /**< bit:      7  If set AHB matrix has two output ports   */
    uint32_t CLKGATE:1;                 /**< bit:      8  If set design contains functional clock gates */
    uint32_t PORT0_MUX:1;               /**< bit:      9  If set AHB port 0 is using an AHB mux    */
    uint32_t PORT1_MUX:1;               /**< bit:     10  If set AHB port 1 is using an AHB mux    */
    uint32_t :20;                       /**< bit: 11..30  Reserved */
    uint32_t PROJ:1;                    /**< bit:     31  User Defined Project                     */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_USER_DEF_STATUS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_USER_DEF_STATUS_OFFSET 0x8E0                                         /**<  (PROV_DMA_CTRL_USER_DEF_STATUS) User Defined Configurations  Offset */
#define PROV_DMA_CTRL_USER_DEF_STATUS_RESETVALUE 0x80000001u                                   /**<  (PROV_DMA_CTRL_USER_DEF_STATUS) User Defined Configurations  Reset Value */

#define PROV_DMA_CTRL_USER_DEF_STATUS_INT_NUM_Pos 0                                              /**< (PROV_DMA_CTRL_USER_DEF_STATUS) Number of bits in interrupt bus Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_INT_NUM_Msk (0xFu << PROV_DMA_CTRL_USER_DEF_STATUS_INT_NUM_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) Number of bits in interrupt bus Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_INT_NUM(value) (PROV_DMA_CTRL_USER_DEF_STATUS_INT_NUM_Msk & ((value) << PROV_DMA_CTRL_USER_DEF_STATUS_INT_NUM_Pos))
#define PROV_DMA_CTRL_USER_DEF_STATUS_DUAL_CORE_Pos 5                                              /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set the design has two cores Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_DUAL_CORE_Msk (0x1u << PROV_DMA_CTRL_USER_DEF_STATUS_DUAL_CORE_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set the design has two cores Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_DUAL_CORE PROV_DMA_CTRL_USER_DEF_STATUS_DUAL_CORE_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_USER_DEF_STATUS_DUAL_CORE_Msk instead */
#define PROV_DMA_CTRL_USER_DEF_STATUS_IC_Pos 6                                              /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set an AHB matrix is used Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_IC_Msk (0x1u << PROV_DMA_CTRL_USER_DEF_STATUS_IC_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set an AHB matrix is used Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_IC    PROV_DMA_CTRL_USER_DEF_STATUS_IC_Msk           /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_USER_DEF_STATUS_IC_Msk instead */
#define PROV_DMA_CTRL_USER_DEF_STATUS_IC_DUAL_PORT_Pos 7                                              /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set AHB matrix has two output ports Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_IC_DUAL_PORT_Msk (0x1u << PROV_DMA_CTRL_USER_DEF_STATUS_IC_DUAL_PORT_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set AHB matrix has two output ports Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_IC_DUAL_PORT PROV_DMA_CTRL_USER_DEF_STATUS_IC_DUAL_PORT_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_USER_DEF_STATUS_IC_DUAL_PORT_Msk instead */
#define PROV_DMA_CTRL_USER_DEF_STATUS_CLKGATE_Pos 8                                              /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set design contains functional clock gates Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_CLKGATE_Msk (0x1u << PROV_DMA_CTRL_USER_DEF_STATUS_CLKGATE_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set design contains functional clock gates Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_CLKGATE PROV_DMA_CTRL_USER_DEF_STATUS_CLKGATE_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_USER_DEF_STATUS_CLKGATE_Msk instead */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PORT0_MUX_Pos 9                                              /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set AHB port 0 is using an AHB mux Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PORT0_MUX_Msk (0x1u << PROV_DMA_CTRL_USER_DEF_STATUS_PORT0_MUX_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set AHB port 0 is using an AHB mux Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PORT0_MUX PROV_DMA_CTRL_USER_DEF_STATUS_PORT0_MUX_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_USER_DEF_STATUS_PORT0_MUX_Msk instead */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PORT1_MUX_Pos 10                                             /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set AHB port 1 is using an AHB mux Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PORT1_MUX_Msk (0x1u << PROV_DMA_CTRL_USER_DEF_STATUS_PORT1_MUX_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) If set AHB port 1 is using an AHB mux Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PORT1_MUX PROV_DMA_CTRL_USER_DEF_STATUS_PORT1_MUX_Msk    /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_USER_DEF_STATUS_PORT1_MUX_Msk instead */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PROJ_Pos 31                                             /**< (PROV_DMA_CTRL_USER_DEF_STATUS) User Defined Project Position */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PROJ_Msk (0x1u << PROV_DMA_CTRL_USER_DEF_STATUS_PROJ_Pos)  /**< (PROV_DMA_CTRL_USER_DEF_STATUS) User Defined Project Mask */
#define PROV_DMA_CTRL_USER_DEF_STATUS_PROJ  PROV_DMA_CTRL_USER_DEF_STATUS_PROJ_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_USER_DEF_STATUS_PROJ_Msk instead */
#define PROV_DMA_CTRL_USER_DEF_STATUS_MASK  0x800007EFu                                    /**< \deprecated (PROV_DMA_CTRL_USER_DEF_STATUS) Register MASK  (Use PROV_DMA_CTRL_USER_DEF_STATUS_Msk instead)  */
#define PROV_DMA_CTRL_USER_DEF_STATUS_Msk   0x800007EFu                                    /**< (PROV_DMA_CTRL_USER_DEF_STATUS) Register Mask  */

/* -------- PROV_DMA_CTRL_CORE_DEF_STATUS0 : (PROV_DMA_CTRL Offset: 0x8f0) (R/ 32) User Defined Core Configurations 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CH_NUM:4;                  /**< bit:   0..3  Number of channels (reads 1, should read 4) */
    uint32_t FIFO_SIZE:4;               /**< bit:   4..7  Log2 of FIFO size per channel            */
    uint32_t WCMD_DEPTH:4;              /**< bit:  8..11  Log2 of maximum number of pending write commands */
    uint32_t RCMD_DEPTH:4;              /**< bit: 12..15  Log2 of maximum number of pending read commands */
    uint32_t ADDR_BITS:6;               /**< bit: 16..21  Number of bits in address buses          */
    uint32_t AHB_BUS_32:1;              /**< bit:     22  If set AHB bus is 32 bit otherwise 64 bit */
    uint32_t :1;                        /**< bit:     23  Reserved */
    uint32_t BUFF_BITS:5;               /**< bit: 24..28  Number of bits in BUFFER_SIZE            */
    uint32_t :3;                        /**< bit: 29..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CORE_DEF_STATUS0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

