remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_OFFSET 0x8F0                                         /**<  (PROV_DMA_CTRL_CORE_DEF_STATUS0) User Defined Core Configurations 0  Offset */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_RESETVALUE 0xA601151u                                    /**<  (PROV_DMA_CTRL_CORE_DEF_STATUS0) User Defined Core Configurations 0  Reset Value */

#define PROV_DMA_CTRL_CORE_DEF_STATUS0_CH_NUM_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Number of channels (reads 1, should read 4) Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_CH_NUM_Msk (0xFu << PROV_DMA_CTRL_CORE_DEF_STATUS0_CH_NUM_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Number of channels (reads 1, should read 4) Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_CH_NUM(value) (PROV_DMA_CTRL_CORE_DEF_STATUS0_CH_NUM_Msk & ((value) << PROV_DMA_CTRL_CORE_DEF_STATUS0_CH_NUM_Pos))
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_FIFO_SIZE_Pos 4                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Log2 of FIFO size per channel Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_FIFO_SIZE_Msk (0xFu << PROV_DMA_CTRL_CORE_DEF_STATUS0_FIFO_SIZE_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Log2 of FIFO size per channel Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_FIFO_SIZE(value) (PROV_DMA_CTRL_CORE_DEF_STATUS0_FIFO_SIZE_Msk & ((value) << PROV_DMA_CTRL_CORE_DEF_STATUS0_FIFO_SIZE_Pos))
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_WCMD_DEPTH_Pos 8                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Log2 of maximum number of pending write commands Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_WCMD_DEPTH_Msk (0xFu << PROV_DMA_CTRL_CORE_DEF_STATUS0_WCMD_DEPTH_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Log2 of maximum number of pending write commands Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_WCMD_DEPTH(value) (PROV_DMA_CTRL_CORE_DEF_STATUS0_WCMD_DEPTH_Msk & ((value) << PROV_DMA_CTRL_CORE_DEF_STATUS0_WCMD_DEPTH_Pos))
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_RCMD_DEPTH_Pos 12                                             /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Log2 of maximum number of pending read commands Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_RCMD_DEPTH_Msk (0xFu << PROV_DMA_CTRL_CORE_DEF_STATUS0_RCMD_DEPTH_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Log2 of maximum number of pending read commands Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_RCMD_DEPTH(value) (PROV_DMA_CTRL_CORE_DEF_STATUS0_RCMD_DEPTH_Msk & ((value) << PROV_DMA_CTRL_CORE_DEF_STATUS0_RCMD_DEPTH_Pos))
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_ADDR_BITS_Pos 16                                             /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Number of bits in address buses Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_ADDR_BITS_Msk (0x3Fu << PROV_DMA_CTRL_CORE_DEF_STATUS0_ADDR_BITS_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Number of bits in address buses Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_ADDR_BITS(value) (PROV_DMA_CTRL_CORE_DEF_STATUS0_ADDR_BITS_Msk & ((value) << PROV_DMA_CTRL_CORE_DEF_STATUS0_ADDR_BITS_Pos))
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_AHB_BUS_32_Pos 22                                             /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) If set AHB bus is 32 bit otherwise 64 bit Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_AHB_BUS_32_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS0_AHB_BUS_32_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) If set AHB bus is 32 bit otherwise 64 bit Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_AHB_BUS_32 PROV_DMA_CTRL_CORE_DEF_STATUS0_AHB_BUS_32_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS0_AHB_BUS_32_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_BUFF_BITS_Pos 24                                             /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Number of bits in BUFFER_SIZE Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_BUFF_BITS_Msk (0x1Fu << PROV_DMA_CTRL_CORE_DEF_STATUS0_BUFF_BITS_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Number of bits in BUFFER_SIZE Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_BUFF_BITS(value) (PROV_DMA_CTRL_CORE_DEF_STATUS0_BUFF_BITS_Msk & ((value) << PROV_DMA_CTRL_CORE_DEF_STATUS0_BUFF_BITS_Pos))
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_MASK 0x1F7FFFFFu                                    /**< \deprecated (PROV_DMA_CTRL_CORE_DEF_STATUS0) Register MASK  (Use PROV_DMA_CTRL_CORE_DEF_STATUS0_Msk instead)  */
#define PROV_DMA_CTRL_CORE_DEF_STATUS0_Msk  0x1F7FFFFFu                                    /**< (PROV_DMA_CTRL_CORE_DEF_STATUS0) Register Mask  */

/* -------- PROV_DMA_CTRL_CORE_DEF_STATUS1 : (PROV_DMA_CTRL Offset: 0x8f4) (R/ 16) User Defined Core Configurations 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint16_t WDT:1;                     /**< bit:      0  Set if core has watchdog timer           */
    uint16_t AHB_TIMEOUT:1;             /**< bit:      1  Set if core supports timeouts on AHB read and write buses */
    uint16_t TOKENS:1;                  /**< bit:      2  Set if core has tokens support           */
    uint16_t PRIO:1;                    /**< bit:      3  Set if core has priority modes support   */
    uint16_t OUTS:1;                    /**< bit:      4  Set if core supports outstanding mode    */
    uint16_t WAIT:1;                    /**< bit:      5  Set if core supports scheduled channels  */
    uint16_t BLOCK:1;                   /**< bit:      6  Set if core supports block transfer      */
    uint16_t JOINT:1;                   /**< bit:      7  Set if core supports joint mode          */
    uint16_t INDEPENDENT:1;             /**< bit:      8  Set if core supports independent mode    */
    uint16_t PERIPH:1;                  /**< bit:      9  Set if core supports peripherals         */
    uint16_t LISTS:1;                   /**< bit:     10  Set if core supports command lists       */
    uint16_t END:1;                     /**< bit:     11  Set if core supports endianness swapping */
    uint16_t CLKDIV:1;                  /**< bit:     12  Set if core supports clock division ratios */
    uint16_t :3;                        /**< bit: 13..15  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint16_t reg;                         /**< Type used for register access */
} PROV_DMA_CTRL_CORE_DEF_STATUS1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PROV_DMA_CTRL_CORE_DEF_STATUS1_OFFSET 0x8F4                                         /**<  (PROV_DMA_CTRL_CORE_DEF_STATUS1) User Defined Core Configurations 1  Offset */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_RESETVALUE 0xF87u                                        /**<  (PROV_DMA_CTRL_CORE_DEF_STATUS1) User Defined Core Configurations 1  Reset Value */

#define PROV_DMA_CTRL_CORE_DEF_STATUS1_WDT_Pos 0                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core has watchdog timer Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_WDT_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_WDT_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core has watchdog timer Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_WDT  PROV_DMA_CTRL_CORE_DEF_STATUS1_WDT_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_WDT_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_AHB_TIMEOUT_Pos 1                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports timeouts on AHB read and write buses Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_AHB_TIMEOUT_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_AHB_TIMEOUT_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports timeouts on AHB read and write buses Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_AHB_TIMEOUT PROV_DMA_CTRL_CORE_DEF_STATUS1_AHB_TIMEOUT_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_AHB_TIMEOUT_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_TOKENS_Pos 2                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core has tokens support Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_TOKENS_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_TOKENS_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core has tokens support Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_TOKENS PROV_DMA_CTRL_CORE_DEF_STATUS1_TOKENS_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_TOKENS_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_PRIO_Pos 3                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core has priority modes support Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_PRIO_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_PRIO_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core has priority modes support Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_PRIO PROV_DMA_CTRL_CORE_DEF_STATUS1_PRIO_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_PRIO_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_OUTS_Pos 4                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports outstanding mode Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_OUTS_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_OUTS_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports outstanding mode Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_OUTS PROV_DMA_CTRL_CORE_DEF_STATUS1_OUTS_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_OUTS_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_WAIT_Pos 5                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports scheduled channels Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_WAIT_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_WAIT_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports scheduled channels Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_WAIT PROV_DMA_CTRL_CORE_DEF_STATUS1_WAIT_Msk        /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_WAIT_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_BLOCK_Pos 6                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports block transfer Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_BLOCK_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_BLOCK_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports block transfer Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_BLOCK PROV_DMA_CTRL_CORE_DEF_STATUS1_BLOCK_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_BLOCK_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_JOINT_Pos 7                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports joint mode Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_JOINT_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_JOINT_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports joint mode Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_JOINT PROV_DMA_CTRL_CORE_DEF_STATUS1_JOINT_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_JOINT_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_INDEPENDENT_Pos 8                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports independent mode Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_INDEPENDENT_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_INDEPENDENT_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports independent mode Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_INDEPENDENT PROV_DMA_CTRL_CORE_DEF_STATUS1_INDEPENDENT_Msk  /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_INDEPENDENT_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_PERIPH_Pos 9                                              /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports peripherals Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_PERIPH_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_PERIPH_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports peripherals Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_PERIPH PROV_DMA_CTRL_CORE_DEF_STATUS1_PERIPH_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_PERIPH_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_LISTS_Pos 10                                             /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports command lists Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_LISTS_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_LISTS_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports command lists Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_LISTS PROV_DMA_CTRL_CORE_DEF_STATUS1_LISTS_Msk       /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_LISTS_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_END_Pos 11                                             /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports endianness swapping Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_END_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_END_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports endianness swapping Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_END  PROV_DMA_CTRL_CORE_DEF_STATUS1_END_Msk         /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_END_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_CLKDIV_Pos 12                                             /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports clock division ratios Position */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_CLKDIV_Msk (0x1u << PROV_DMA_CTRL_CORE_DEF_STATUS1_CLKDIV_Pos)  /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Set if core supports clock division ratios Mask */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_CLKDIV PROV_DMA_CTRL_CORE_DEF_STATUS1_CLKDIV_Msk      /**< \deprecated Old style mask definition for 1 bit bitfield. Use PROV_DMA_CTRL_CORE_DEF_STATUS1_CLKDIV_Msk instead */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_MASK 0x1FFFu                                        /**< \deprecated (PROV_DMA_CTRL_CORE_DEF_STATUS1) Register MASK  (Use PROV_DMA_CTRL_CORE_DEF_STATUS1_Msk instead)  */
#define PROV_DMA_CTRL_CORE_DEF_STATUS1_Msk  0x1FFFu                                        /**< (PROV_DMA_CTRL_CORE_DEF_STATUS1) Register Mask  */

