remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief PROV_DMA_CTRL hardware registers */
typedef struct {  /* 4 Channel DMA Controller */
  RwReg   CH0_CMD_REG0;   /**< (PROV_DMA_CTRL Offset: 0x00) Channel 0 First Line Channel Command */
  RwReg   CH0_CMD_REG1;   /**< (PROV_DMA_CTRL Offset: 0x04) Channel 0 Second Line Channel Command */
  RwReg16 CH0_CMD_REG2;   /**< (PROV_DMA_CTRL Offset: 0x08) Channel 0 Third Line Channel Command */
  __I  uint8_t  Reserved1[2];
  RwReg   CH0_CMD_REG3;   /**< (PROV_DMA_CTRL Offset: 0x0C) Channel 0 Fourth Line Channel Command */
  RwReg   CH0_STATIC_REG0; /**< (PROV_DMA_CTRL Offset: 0x10) Channel 0 Static Configuration Read */
  RwReg   CH0_STATIC_REG1; /**< (PROV_DMA_CTRL Offset: 0x14) Channel 0 Static Configuration Write */
  RwReg   CH0_STATIC_REG2; /**< (PROV_DMA_CTRL Offset: 0x18) Channel 0 Block Mode */
  __I  uint32_t Reserved2[1];
  RwReg   CH0_STATIC_REG4; /**< (PROV_DMA_CTRL Offset: 0x20) Channel 0 Static Configuration Peripheral */
  __I  uint32_t Reserved3[2];
  RoReg16 CH0_RESRICT_REG; /**< (PROV_DMA_CTRL Offset: 0x2C) Channel 0 Restrictions Status Register */
  __I  uint8_t  Reserved4[10];
  RoReg   CH0_FIFO_FULLNESS_REG; /**< (PROV_DMA_CTRL Offset: 0x38) Channel 0 FIFO Fullness Status Register */
  __I  uint32_t Reserved5[1];
  RwReg8  CH0_CH_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0x40) Channel 0 Channel Enable Register */
  __I  uint8_t  Reserved6[3];
  WoReg8  CH0_CH_START_REG; /**< (PROV_DMA_CTRL Offset: 0x44) Channel 0 Channel Start Register */
  __I  uint8_t  Reserved7[3];
  RoReg8  CH0_CH_ACTIVE_REG; /**< (PROV_DMA_CTRL Offset: 0x48) Channel 0 Channel Active Status Register */
  __I  uint8_t  Reserved8[7];
  RoReg   CH0_COUNT_REG;  /**< (PROV_DMA_CTRL Offset: 0x50) Channel 0 Buffer Counter Status Register */
  __I  uint32_t Reserved9[19];
  RwReg8  CH0_INT_RAWSTAT_REG; /**< (PROV_DMA_CTRL Offset: 0xA0) Channel 0 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
  __I  uint8_t  Reserved10[3];
  RwReg8  CH0_INT_CLEAR_REG; /**< (PROV_DMA_CTRL Offset: 0xA4) Channel 0 Interrupt Clear (Write 1 to clear) */
  __I  uint8_t  Reserved11[3];
  RwReg8  CH0_INT_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0xA8) Channel 0 Interrupt Enable */
  __I  uint8_t  Reserved12[3];
  RwReg8  CH0_INT_STATUS_REG; /**< (PROV_DMA_CTRL Offset: 0xAC) Channel 0 Interrupt Status */
  __I  uint8_t  Reserved13[83];
  RwReg   CH1_CMD_REG0;   /**< (PROV_DMA_CTRL Offset: 0x100) Channel 1 First Line Channel Command */
  RwReg   CH1_CMD_REG1;   /**< (PROV_DMA_CTRL Offset: 0x104) Channel 1 Second Line Channel Command */
  RwReg16 CH1_CMD_REG2;   /**< (PROV_DMA_CTRL Offset: 0x108) Channel 1 Third Line Channel Command */
  __I  uint8_t  Reserved14[2];
  RwReg   CH1_CMD_REG3;   /**< (PROV_DMA_CTRL Offset: 0x10C) Channel 1 Fourth Line Channel Command */
  RwReg   CH1_STATIC_REG0; /**< (PROV_DMA_CTRL Offset: 0x110) Channel 1 Static Configuration Read */
  RwReg   CH1_STATIC_REG1; /**< (PROV_DMA_CTRL Offset: 0x114) Channel 1 Static Configuration Write */
  RwReg   CH1_STATIC_REG2; /**< (PROV_DMA_CTRL Offset: 0x118) Channel 1 Block Mode */
  __I  uint32_t Reserved15[1];
  RwReg   CH1_STATIC_REG4; /**< (PROV_DMA_CTRL Offset: 0x120) Channel 1 Static Configuration Peripheral */
  __I  uint32_t Reserved16[2];
  RoReg16 CH1_RESRICT_REG; /**< (PROV_DMA_CTRL Offset: 0x12C) Channel 1 Restrictions Status Register */
  __I  uint8_t  Reserved17[10];
  RoReg   CH1_FIFO_FULLNESS_REG; /**< (PROV_DMA_CTRL Offset: 0x138) Channel 1 FIFO Fullness Status Register */
  __I  uint32_t Reserved18[1];
  RwReg8  CH1_CH_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0x140) Channel 1 Channel Enable Register */
  __I  uint8_t  Reserved19[3];
  WoReg8  CH1_CH_START_REG; /**< (PROV_DMA_CTRL Offset: 0x144) Channel 1 Channel Start Register */
  __I  uint8_t  Reserved20[3];
  RoReg8  CH1_CH_ACTIVE_REG; /**< (PROV_DMA_CTRL Offset: 0x148) Channel 1 Channel Active Status Register */
  __I  uint8_t  Reserved21[7];
  RoReg   CH1_COUNT_REG;  /**< (PROV_DMA_CTRL Offset: 0x150) Channel 1 Buffer Counter Status Register */
  __I  uint32_t Reserved22[19];
  RwReg8  CH1_INT_RAWSTAT_REG; /**< (PROV_DMA_CTRL Offset: 0x1A0) Channel 1 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
  __I  uint8_t  Reserved23[3];
  RwReg8  CH1_INT_CLEAR_REG; /**< (PROV_DMA_CTRL Offset: 0x1A4) Channel 1 Interrupt Clear (Write 1 to clear) */
  __I  uint8_t  Reserved24[3];
  RwReg8  CH1_INT_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0x1A8) Channel 1 Interrupt Enable */
  __I  uint8_t  Reserved25[3];
  RwReg8  CH1_INT_STATUS_REG; /**< (PROV_DMA_CTRL Offset: 0x1AC) Channel 1 Interrupt Status */
  __I  uint8_t  Reserved26[83];
  RwReg   CH2_CMD_REG0;   /**< (PROV_DMA_CTRL Offset: 0x200) Channel 2 First Line Channel Command */
  RwReg   CH2_CMD_REG1;   /**< (PROV_DMA_CTRL Offset: 0x204) Channel 2 Second Line Channel Command */
  RwReg16 CH2_CMD_REG2;   /**< (PROV_DMA_CTRL Offset: 0x208) Channel 2 Third Line Channel Command */
  __I  uint8_t  Reserved27[2];
  RwReg   CH2_CMD_REG3;   /**< (PROV_DMA_CTRL Offset: 0x20C) Channel 2 Fourth Line Channel Command */
  RwReg   CH2_STATIC_REG0; /**< (PROV_DMA_CTRL Offset: 0x210) Channel 2 Static Configuration Read */
  RwReg   CH2_STATIC_REG1; /**< (PROV_DMA_CTRL Offset: 0x214) Channel 2 Static Configuration Write */
  RwReg   CH2_STATIC_REG2; /**< (PROV_DMA_CTRL Offset: 0x218) Channel 2 Block Mode */
  __I  uint32_t Reserved28[1];
  RwReg   CH2_STATIC_REG4; /**< (PROV_DMA_CTRL Offset: 0x220) Channel 2 Static Configuration Peripheral */
  __I  uint32_t Reserved29[2];
  RoReg16 CH2_RESRICT_REG; /**< (PROV_DMA_CTRL Offset: 0x22C) Channel 2 Restrictions Status Register */
  __I  uint8_t  Reserved30[10];
  RoReg   CH2_FIFO_FULLNESS_REG; /**< (PROV_DMA_CTRL Offset: 0x238) Channel 2 FIFO Fullness Status Register */
  __I  uint32_t Reserved31[1];
  RwReg8  CH2_CH_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0x240) Channel 2 Channel Enable Register */
  __I  uint8_t  Reserved32[3];
  WoReg8  CH2_CH_START_REG; /**< (PROV_DMA_CTRL Offset: 0x244) Channel 2 Channel Start Register */
  __I  uint8_t  Reserved33[3];
  RoReg8  CH2_CH_ACTIVE_REG; /**< (PROV_DMA_CTRL Offset: 0x248) Channel 2 Channel Active Status Register */
  __I  uint8_t  Reserved34[7];
  RoReg   CH2_COUNT_REG;  /**< (PROV_DMA_CTRL Offset: 0x250) Channel 2 Buffer Counter Status Register */
  __I  uint32_t Reserved35[19];
  RwReg8  CH2_INT_RAWSTAT_REG; /**< (PROV_DMA_CTRL Offset: 0x2A0) Channel 2 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
  __I  uint8_t  Reserved36[3];
  RwReg8  CH2_INT_CLEAR_REG; /**< (PROV_DMA_CTRL Offset: 0x2A4) Channel 2 Interrupt Clear (Write 1 to clear) */
  __I  uint8_t  Reserved37[3];
  RwReg8  CH2_INT_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0x2A8) Channel 2 Interrupt Enable */
  __I  uint8_t  Reserved38[3];
  RwReg8  CH2_INT_STATUS_REG; /**< (PROV_DMA_CTRL Offset: 0x2AC) Channel 2 Interrupt Status */
  __I  uint8_t  Reserved39[83];
  RwReg   CH3_CMD_REG0;   /**< (PROV_DMA_CTRL Offset: 0x300) Channel 3 First Line Channel Command */
  RwReg   CH3_CMD_REG1;   /**< (PROV_DMA_CTRL Offset: 0x304) Channel 3 Second Line Channel Command */
  RwReg16 CH3_CMD_REG2;   /**< (PROV_DMA_CTRL Offset: 0x308) Channel 3 Third Line Channel Command */
  __I  uint8_t  Reserved40[2];
  RwReg   CH3_CMD_REG3;   /**< (PROV_DMA_CTRL Offset: 0x30C) Channel 3 Fourth Line Channel Command */
  RwReg   CH3_STATIC_REG0; /**< (PROV_DMA_CTRL Offset: 0x310) Channel 3 Static Configuration Read */
  RwReg   CH3_STATIC_REG1; /**< (PROV_DMA_CTRL Offset: 0x314) Channel 3 Static Configuration Write */
  RwReg   CH3_STATIC_REG2; /**< (PROV_DMA_CTRL Offset: 0x318) Channel 3 Block Mode */
  __I  uint32_t Reserved41[1];
  RwReg   CH3_STATIC_REG4; /**< (PROV_DMA_CTRL Offset: 0x320) Channel 3 Static Configuration Peripheral */
  __I  uint32_t Reserved42[2];
  RoReg16 CH3_RESRICT_REG; /**< (PROV_DMA_CTRL Offset: 0x32C) Channel 3 Restrictions Status Register */
  __I  uint8_t  Reserved43[10];
  RoReg   CH3_FIFO_FULLNESS_REG; /**< (PROV_DMA_CTRL Offset: 0x338) Channel 3 FIFO Fullness Status Register */
  __I  uint32_t Reserved44[1];
  RwReg8  CH3_CH_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0x340) Channel 3 Channel Enable Register */
  __I  uint8_t  Reserved45[3];
  WoReg8  CH3_CH_START_REG; /**< (PROV_DMA_CTRL Offset: 0x344) Channel 3 Channel Start Register */
  __I  uint8_t  Reserved46[3];
  RoReg8  CH3_CH_ACTIVE_REG; /**< (PROV_DMA_CTRL Offset: 0x348) Channel 3 Channel Active Status Register */
  __I  uint8_t  Reserved47[7];
  RoReg   CH3_COUNT_REG;  /**< (PROV_DMA_CTRL Offset: 0x350) Channel 3 Buffer Counter Status Register */
  __I  uint32_t Reserved48[19];
  RwReg8  CH3_INT_RAWSTAT_REG; /**< (PROV_DMA_CTRL Offset: 0x3A0) Channel 3 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
  __I  uint8_t  Reserved49[3];
  RwReg8  CH3_INT_CLEAR_REG; /**< (PROV_DMA_CTRL Offset: 0x3A4) Channel 3 Interrupt Clear (Write 1 to clear) */
  __I  uint8_t  Reserved50[3];
  RwReg8  CH3_INT_ENABLE_REG; /**< (PROV_DMA_CTRL Offset: 0x3A8) Channel 3 Interrupt Enable */
  __I  uint8_t  Reserved51[3];
  RwReg8  CH3_INT_STATUS_REG; /**< (PROV_DMA_CTRL Offset: 0x3AC) Channel 3 Interrupt Status */
  __I  uint8_t  Reserved52[1107];
  RoReg8  CORE_INT_STATUS; /**< (PROV_DMA_CTRL Offset: 0x800) Indicates which channels caused interrupt */
  __I  uint8_t  Reserved53[47];
  RwReg8  CORE_JOINT_MODE; /**< (PROV_DMA_CTRL Offset: 0x830) If set, core works in joint mode */
  __I  uint8_t  Reserved54[7];
  RwReg16 CORE_PRIORITY;  /**< (PROV_DMA_CTRL Offset: 0x838) Core Priority Channels */
  __I  uint8_t  Reserved55[6];
  RwReg8  CORE_CLKDIV;    /**< (PROV_DMA_CTRL Offset: 0x840) Ratio between main clock and core clock */
  __I  uint8_t  Reserved56[7];
  WoReg8  CORE_CH_START;  /**< (PROV_DMA_CTRL Offset: 0x848) Channel Start */
  __I  uint8_t  Reserved57[7];
  RwReg   PERIPH_RX_CTRL; /**< (PROV_DMA_CTRL Offset: 0x850) Direct control of peripheral RX request */
  __I  uint32_t Reserved58[3];
  RwReg   PERIPH_TX_CTRL; /**< (PROV_DMA_CTRL Offset: 0x860) Direct control of peripheral TX request */
  __I  uint32_t Reserved59[27];
  RoReg8  CORE_IDLE;      /**< (PROV_DMA_CTRL Offset: 0x8D0) Indicates all channels have stopped and transactions have completed */
  __I  uint8_t  Reserved60[15];
  RoReg   USER_DEF_STATUS; /**< (PROV_DMA_CTRL Offset: 0x8E0) User Defined Configurations */
  __I  uint32_t Reserved61[3];
  RoReg   CORE_DEF_STATUS0; /**< (PROV_DMA_CTRL Offset: 0x8F0) User Defined Core Configurations 0 */
  RoReg16 CORE_DEF_STATUS1; /**< (PROV_DMA_CTRL Offset: 0x8F4) User Defined Core Configurations 1 */
} ProvDmaCtrl;

