remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/prov_dma_ctrl.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief PROV_DMA_CTRL hardware registers */
typedef struct {  /* 4 Channel DMA Controller */
  __IO PROV_DMA_CTRL_CH0_CMD_REG0_Type CH0_CMD_REG0;   /**< Offset: 0x00 (R/W  32) Channel 0 First Line Channel Command */
  __IO PROV_DMA_CTRL_CH0_CMD_REG1_Type CH0_CMD_REG1;   /**< Offset: 0x04 (R/W  32) Channel 0 Second Line Channel Command */
  __IO PROV_DMA_CTRL_CH0_CMD_REG2_Type CH0_CMD_REG2;   /**< Offset: 0x08 (R/W  16) Channel 0 Third Line Channel Command */
       RoReg8                         Reserved1[0x2];
  __IO PROV_DMA_CTRL_CH0_CMD_REG3_Type CH0_CMD_REG3;   /**< Offset: 0x0C (R/W  32) Channel 0 Fourth Line Channel Command */
  __IO PROV_DMA_CTRL_CH0_STATIC_REG0_Type CH0_STATIC_REG0; /**< Offset: 0x10 (R/W  32) Channel 0 Static Configuration Read */
  __IO PROV_DMA_CTRL_CH0_STATIC_REG1_Type CH0_STATIC_REG1; /**< Offset: 0x14 (R/W  32) Channel 0 Static Configuration Write */
  __IO PROV_DMA_CTRL_CH0_STATIC_REG2_Type CH0_STATIC_REG2; /**< Offset: 0x18 (R/W  32) Channel 0 Block Mode */
       RoReg8                         Reserved2[0x4];
  __IO PROV_DMA_CTRL_CH0_STATIC_REG4_Type CH0_STATIC_REG4; /**< Offset: 0x20 (R/W  32) Channel 0 Static Configuration Peripheral */
       RoReg8                         Reserved3[0x8];
  __I  PROV_DMA_CTRL_CH0_RESRICT_REG_Type CH0_RESRICT_REG; /**< Offset: 0x2C (R/   16) Channel 0 Restrictions Status Register */
       RoReg8                         Reserved4[0xA];
  __I  PROV_DMA_CTRL_CH0_FIFO_FULLNESS_REG_Type CH0_FIFO_FULLNESS_REG; /**< Offset: 0x38 (R/   32) Channel 0 FIFO Fullness Status Register */
       RoReg8                         Reserved5[0x4];
  __IO PROV_DMA_CTRL_CH0_CH_ENABLE_REG_Type CH0_CH_ENABLE_REG; /**< Offset: 0x40 (R/W   8) Channel 0 Channel Enable Register */
       RoReg8                         Reserved6[0x3];
  __O  PROV_DMA_CTRL_CH0_CH_START_REG_Type CH0_CH_START_REG; /**< Offset: 0x44 ( /W   8) Channel 0 Channel Start Register */
       RoReg8                         Reserved7[0x3];
  __I  PROV_DMA_CTRL_CH0_CH_ACTIVE_REG_Type CH0_CH_ACTIVE_REG; /**< Offset: 0x48 (R/    8) Channel 0 Channel Active Status Register */
       RoReg8                         Reserved8[0x7];
  __I  PROV_DMA_CTRL_CH0_COUNT_REG_Type CH0_COUNT_REG;  /**< Offset: 0x50 (R/   32) Channel 0 Buffer Counter Status Register */
       RoReg8                         Reserved9[0x4C];
  __IO PROV_DMA_CTRL_CH0_INT_RAWSTAT_REG_Type CH0_INT_RAWSTAT_REG; /**< Offset: 0xA0 (R/W   8) Channel 0 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
       RoReg8                         Reserved10[0x3];
  __IO PROV_DMA_CTRL_CH0_INT_CLEAR_REG_Type CH0_INT_CLEAR_REG; /**< Offset: 0xA4 (R/W   8) Channel 0 Interrupt Clear (Write 1 to clear) */
       RoReg8                         Reserved11[0x3];
  __IO PROV_DMA_CTRL_CH0_INT_ENABLE_REG_Type CH0_INT_ENABLE_REG; /**< Offset: 0xA8 (R/W   8) Channel 0 Interrupt Enable */
       RoReg8                         Reserved12[0x3];
  __IO PROV_DMA_CTRL_CH0_INT_STATUS_REG_Type CH0_INT_STATUS_REG; /**< Offset: 0xAC (R/W   8) Channel 0 Interrupt Status */
       RoReg8                         Reserved13[0x53];
  __IO PROV_DMA_CTRL_CH1_CMD_REG0_Type CH1_CMD_REG0;   /**< Offset: 0x100 (R/W  32) Channel 1 First Line Channel Command */
  __IO PROV_DMA_CTRL_CH1_CMD_REG1_Type CH1_CMD_REG1;   /**< Offset: 0x104 (R/W  32) Channel 1 Second Line Channel Command */
  __IO PROV_DMA_CTRL_CH1_CMD_REG2_Type CH1_CMD_REG2;   /**< Offset: 0x108 (R/W  16) Channel 1 Third Line Channel Command */
       RoReg8                         Reserved14[0x2];
  __IO PROV_DMA_CTRL_CH1_CMD_REG3_Type CH1_CMD_REG3;   /**< Offset: 0x10C (R/W  32) Channel 1 Fourth Line Channel Command */
  __IO PROV_DMA_CTRL_CH1_STATIC_REG0_Type CH1_STATIC_REG0; /**< Offset: 0x110 (R/W  32) Channel 1 Static Configuration Read */
  __IO PROV_DMA_CTRL_CH1_STATIC_REG1_Type CH1_STATIC_REG1; /**< Offset: 0x114 (R/W  32) Channel 1 Static Configuration Write */
  __IO PROV_DMA_CTRL_CH1_STATIC_REG2_Type CH1_STATIC_REG2; /**< Offset: 0x118 (R/W  32) Channel 1 Block Mode */
       RoReg8                         Reserved15[0x4];
  __IO PROV_DMA_CTRL_CH1_STATIC_REG4_Type CH1_STATIC_REG4; /**< Offset: 0x120 (R/W  32) Channel 1 Static Configuration Peripheral */
       RoReg8                         Reserved16[0x8];
  __I  PROV_DMA_CTRL_CH1_RESRICT_REG_Type CH1_RESRICT_REG; /**< Offset: 0x12C (R/   16) Channel 1 Restrictions Status Register */
       RoReg8                         Reserved17[0xA];
  __I  PROV_DMA_CTRL_CH1_FIFO_FULLNESS_REG_Type CH1_FIFO_FULLNESS_REG; /**< Offset: 0x138 (R/   32) Channel 1 FIFO Fullness Status Register */
       RoReg8                         Reserved18[0x4];
  __IO PROV_DMA_CTRL_CH1_CH_ENABLE_REG_Type CH1_CH_ENABLE_REG; /**< Offset: 0x140 (R/W   8) Channel 1 Channel Enable Register */
       RoReg8                         Reserved19[0x3];
  __O  PROV_DMA_CTRL_CH1_CH_START_REG_Type CH1_CH_START_REG; /**< Offset: 0x144 ( /W   8) Channel 1 Channel Start Register */
       RoReg8                         Reserved20[0x3];
  __I  PROV_DMA_CTRL_CH1_CH_ACTIVE_REG_Type CH1_CH_ACTIVE_REG; /**< Offset: 0x148 (R/    8) Channel 1 Channel Active Status Register */
       RoReg8                         Reserved21[0x7];
  __I  PROV_DMA_CTRL_CH1_COUNT_REG_Type CH1_COUNT_REG;  /**< Offset: 0x150 (R/   32) Channel 1 Buffer Counter Status Register */
       RoReg8                         Reserved22[0x4C];
  __IO PROV_DMA_CTRL_CH1_INT_RAWSTAT_REG_Type CH1_INT_RAWSTAT_REG; /**< Offset: 0x1A0 (R/W   8) Channel 1 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
       RoReg8                         Reserved23[0x3];
  __IO PROV_DMA_CTRL_CH1_INT_CLEAR_REG_Type CH1_INT_CLEAR_REG; /**< Offset: 0x1A4 (R/W   8) Channel 1 Interrupt Clear (Write 1 to clear) */
       RoReg8                         Reserved24[0x3];
  __IO PROV_DMA_CTRL_CH1_INT_ENABLE_REG_Type CH1_INT_ENABLE_REG; /**< Offset: 0x1A8 (R/W   8) Channel 1 Interrupt Enable */
       RoReg8                         Reserved25[0x3];
  __IO PROV_DMA_CTRL_CH1_INT_STATUS_REG_Type CH1_INT_STATUS_REG; /**< Offset: 0x1AC (R/W   8) Channel 1 Interrupt Status */
       RoReg8                         Reserved26[0x53];
  __IO PROV_DMA_CTRL_CH2_CMD_REG0_Type CH2_CMD_REG0;   /**< Offset: 0x200 (R/W  32) Channel 2 First Line Channel Command */
  __IO PROV_DMA_CTRL_CH2_CMD_REG1_Type CH2_CMD_REG1;   /**< Offset: 0x204 (R/W  32) Channel 2 Second Line Channel Command */
  __IO PROV_DMA_CTRL_CH2_CMD_REG2_Type CH2_CMD_REG2;   /**< Offset: 0x208 (R/W  16) Channel 2 Third Line Channel Command */
       RoReg8                         Reserved27[0x2];
  __IO PROV_DMA_CTRL_CH2_CMD_REG3_Type CH2_CMD_REG3;   /**< Offset: 0x20C (R/W  32) Channel 2 Fourth Line Channel Command */
  __IO PROV_DMA_CTRL_CH2_STATIC_REG0_Type CH2_STATIC_REG0; /**< Offset: 0x210 (R/W  32) Channel 2 Static Configuration Read */
  __IO PROV_DMA_CTRL_CH2_STATIC_REG1_Type CH2_STATIC_REG1; /**< Offset: 0x214 (R/W  32) Channel 2 Static Configuration Write */
  __IO PROV_DMA_CTRL_CH2_STATIC_REG2_Type CH2_STATIC_REG2; /**< Offset: 0x218 (R/W  32) Channel 2 Block Mode */
       RoReg8                         Reserved28[0x4];
  __IO PROV_DMA_CTRL_CH2_STATIC_REG4_Type CH2_STATIC_REG4; /**< Offset: 0x220 (R/W  32) Channel 2 Static Configuration Peripheral */
       RoReg8                         Reserved29[0x8];
  __I  PROV_DMA_CTRL_CH2_RESRICT_REG_Type CH2_RESRICT_REG; /**< Offset: 0x22C (R/   16) Channel 2 Restrictions Status Register */
       RoReg8                         Reserved30[0xA];
  __I  PROV_DMA_CTRL_CH2_FIFO_FULLNESS_REG_Type CH2_FIFO_FULLNESS_REG; /**< Offset: 0x238 (R/   32) Channel 2 FIFO Fullness Status Register */
       RoReg8                         Reserved31[0x4];
  __IO PROV_DMA_CTRL_CH2_CH_ENABLE_REG_Type CH2_CH_ENABLE_REG; /**< Offset: 0x240 (R/W   8) Channel 2 Channel Enable Register */
       RoReg8                         Reserved32[0x3];
  __O  PROV_DMA_CTRL_CH2_CH_START_REG_Type CH2_CH_START_REG; /**< Offset: 0x244 ( /W   8) Channel 2 Channel Start Register */
       RoReg8                         Reserved33[0x3];
  __I  PROV_DMA_CTRL_CH2_CH_ACTIVE_REG_Type CH2_CH_ACTIVE_REG; /**< Offset: 0x248 (R/    8) Channel 2 Channel Active Status Register */
       RoReg8                         Reserved34[0x7];
  __I  PROV_DMA_CTRL_CH2_COUNT_REG_Type CH2_COUNT_REG;  /**< Offset: 0x250 (R/   32) Channel 2 Buffer Counter Status Register */
       RoReg8                         Reserved35[0x4C];
  __IO PROV_DMA_CTRL_CH2_INT_RAWSTAT_REG_Type CH2_INT_RAWSTAT_REG; /**< Offset: 0x2A0 (R/W   8) Channel 2 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
       RoReg8                         Reserved36[0x3];
  __IO PROV_DMA_CTRL_CH2_INT_CLEAR_REG_Type CH2_INT_CLEAR_REG; /**< Offset: 0x2A4 (R/W   8) Channel 2 Interrupt Clear (Write 1 to clear) */
       RoReg8                         Reserved37[0x3];
  __IO PROV_DMA_CTRL_CH2_INT_ENABLE_REG_Type CH2_INT_ENABLE_REG; /**< Offset: 0x2A8 (R/W   8) Channel 2 Interrupt Enable */
       RoReg8                         Reserved38[0x3];
  __IO PROV_DMA_CTRL_CH2_INT_STATUS_REG_Type CH2_INT_STATUS_REG; /**< Offset: 0x2AC (R/W   8) Channel 2 Interrupt Status */
       RoReg8                         Reserved39[0x53];
  __IO PROV_DMA_CTRL_CH3_CMD_REG0_Type CH3_CMD_REG0;   /**< Offset: 0x300 (R/W  32) Channel 3 First Line Channel Command */
  __IO PROV_DMA_CTRL_CH3_CMD_REG1_Type CH3_CMD_REG1;   /**< Offset: 0x304 (R/W  32) Channel 3 Second Line Channel Command */
  __IO PROV_DMA_CTRL_CH3_CMD_REG2_Type CH3_CMD_REG2;   /**< Offset: 0x308 (R/W  16) Channel 3 Third Line Channel Command */
       RoReg8                         Reserved40[0x2];
  __IO PROV_DMA_CTRL_CH3_CMD_REG3_Type CH3_CMD_REG3;   /**< Offset: 0x30C (R/W  32) Channel 3 Fourth Line Channel Command */
  __IO PROV_DMA_CTRL_CH3_STATIC_REG0_Type CH3_STATIC_REG0; /**< Offset: 0x310 (R/W  32) Channel 3 Static Configuration Read */
  __IO PROV_DMA_CTRL_CH3_STATIC_REG1_Type CH3_STATIC_REG1; /**< Offset: 0x314 (R/W  32) Channel 3 Static Configuration Write */
  __IO PROV_DMA_CTRL_CH3_STATIC_REG2_Type CH3_STATIC_REG2; /**< Offset: 0x318 (R/W  32) Channel 3 Block Mode */
       RoReg8                         Reserved41[0x4];
  __IO PROV_DMA_CTRL_CH3_STATIC_REG4_Type CH3_STATIC_REG4; /**< Offset: 0x320 (R/W  32) Channel 3 Static Configuration Peripheral */
       RoReg8                         Reserved42[0x8];
  __I  PROV_DMA_CTRL_CH3_RESRICT_REG_Type CH3_RESRICT_REG; /**< Offset: 0x32C (R/   16) Channel 3 Restrictions Status Register */
       RoReg8                         Reserved43[0xA];
  __I  PROV_DMA_CTRL_CH3_FIFO_FULLNESS_REG_Type CH3_FIFO_FULLNESS_REG; /**< Offset: 0x338 (R/   32) Channel 3 FIFO Fullness Status Register */
       RoReg8                         Reserved44[0x4];
  __IO PROV_DMA_CTRL_CH3_CH_ENABLE_REG_Type CH3_CH_ENABLE_REG; /**< Offset: 0x340 (R/W   8) Channel 3 Channel Enable Register */
       RoReg8                         Reserved45[0x3];
  __O  PROV_DMA_CTRL_CH3_CH_START_REG_Type CH3_CH_START_REG; /**< Offset: 0x344 ( /W   8) Channel 3 Channel Start Register */
       RoReg8                         Reserved46[0x3];
  __I  PROV_DMA_CTRL_CH3_CH_ACTIVE_REG_Type CH3_CH_ACTIVE_REG; /**< Offset: 0x348 (R/    8) Channel 3 Channel Active Status Register */
       RoReg8                         Reserved47[0x7];
  __I  PROV_DMA_CTRL_CH3_COUNT_REG_Type CH3_COUNT_REG;  /**< Offset: 0x350 (R/   32) Channel 3 Buffer Counter Status Register */
       RoReg8                         Reserved48[0x4C];
  __IO PROV_DMA_CTRL_CH3_INT_RAWSTAT_REG_Type CH3_INT_RAWSTAT_REG; /**< Offset: 0x3A0 (R/W   8) Channel 3 Interrupt Raw Status (Write 1 to any field to issue interrupt) */
       RoReg8                         Reserved49[0x3];
  __IO PROV_DMA_CTRL_CH3_INT_CLEAR_REG_Type CH3_INT_CLEAR_REG; /**< Offset: 0x3A4 (R/W   8) Channel 3 Interrupt Clear (Write 1 to clear) */
       RoReg8                         Reserved50[0x3];
  __IO PROV_DMA_CTRL_CH3_INT_ENABLE_REG_Type CH3_INT_ENABLE_REG; /**< Offset: 0x3A8 (R/W   8) Channel 3 Interrupt Enable */
       RoReg8                         Reserved51[0x3];
  __IO PROV_DMA_CTRL_CH3_INT_STATUS_REG_Type CH3_INT_STATUS_REG; /**< Offset: 0x3AC (R/W   8) Channel 3 Interrupt Status */
       RoReg8                         Reserved52[0x453];
  __I  PROV_DMA_CTRL_CORE_INT_STATUS_Type CORE_INT_STATUS; /**< Offset: 0x800 (R/    8) Indicates which channels caused interrupt */
       RoReg8                         Reserved53[0x2F];
  __IO PROV_DMA_CTRL_CORE_JOINT_MODE_Type CORE_JOINT_MODE; /**< Offset: 0x830 (R/W   8) If set, core works in joint mode */
       RoReg8                         Reserved54[0x7];
  __IO PROV_DMA_CTRL_CORE_PRIORITY_Type CORE_PRIORITY;  /**< Offset: 0x838 (R/W  16) Core Priority Channels */
       RoReg8                         Reserved55[0x6];
  __IO PROV_DMA_CTRL_CORE_CLKDIV_Type CORE_CLKDIV;    /**< Offset: 0x840 (R/W   8) Ratio between main clock and core clock */
       RoReg8                         Reserved56[0x7];
  __O  PROV_DMA_CTRL_CORE_CH_START_Type CORE_CH_START;  /**< Offset: 0x848 ( /W   8) Channel Start */
       RoReg8                         Reserved57[0x7];
  __IO PROV_DMA_CTRL_PERIPH_RX_CTRL_Type PERIPH_RX_CTRL; /**< Offset: 0x850 (R/W  32) Direct control of peripheral RX request */
       RoReg8                         Reserved58[0xC];
  __IO PROV_DMA_CTRL_PERIPH_TX_CTRL_Type PERIPH_TX_CTRL; /**< Offset: 0x860 (R/W  32) Direct control of peripheral TX request */
       RoReg8                         Reserved59[0x6C];
  __I  PROV_DMA_CTRL_CORE_IDLE_Type   CORE_IDLE;      /**< Offset: 0x8D0 (R/    8) Indicates all channels have stopped and transactions have completed */
       RoReg8                         Reserved60[0xF];
  __I  PROV_DMA_CTRL_USER_DEF_STATUS_Type USER_DEF_STATUS; /**< Offset: 0x8E0 (R/   32) User Defined Configurations */
       RoReg8                         Reserved61[0xC];
  __I  PROV_DMA_CTRL_CORE_DEF_STATUS0_Type CORE_DEF_STATUS0; /**< Offset: 0x8F0 (R/   32) User Defined Core Configurations 0 */
  __I  PROV_DMA_CTRL_CORE_DEF_STATUS1_Type CORE_DEF_STATUS1; /**< Offset: 0x8F4 (R/   16) User Defined Core Configurations 1 */
} ProvDmaCtrl;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_PROV_DMA_CTRL_COMPONENT_ */
